{"pageProps":{"preview":false,"post":{"title":"A Guide To Getting Started In Tech","excerpt":"<p>Anyone can transition into tech regardless of their education as long as they are curious about the industry.</p>\n","slug":"a-guide-to-getting-started-in-tech","date":"2022-07-09T12:00:00","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/03/zoxyqjpxvsrnpjtvzkfd.jpg"}},"author":{"node":{"name":"Iyanuoluwa Adenle","firstName":"Iyanuoluwa","lastName":"Adenle","avatar":{"url":"https://secure.gravatar.com/avatar/aeeddafd589107b66a58882d645c7bd5?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Dear Tech Sis","slug":"dear-tech-sis","categoryId":3}}]},"tags":{"edges":[{"node":{"name":"Community"}},{"node":{"name":"Tech"}}]},"content":"\n<p>Getting started in tech can seem daunting at first glance, especially for people without a tech or IT background. The technology sector is booming and you don’t need to have a degree or background in tech before you can get started. The industry is known for its impressive income, excellent work benefits and endless opportunities. Anyone can transition into tech regardless of their education as long as they are curious about the industry.</p>\n\n\n\n<p>Here is a list of how to kickstart your career as a woman in tech:</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What role are you looking for? &nbsp;</strong></h2>\n\n\n\n<p>This is a start. It is important to know if you want coding or non-coding roles in tech when you start your tech journey. This will help you to figure out the skills you will need to acquire as you dive in. While researching the roles in the tech industry, you might find that you are more curious and excited about some roles than others based on your personality, past work experiences and current skills.</p>\n\n\n\n<p>One thing about the tech industry is that there is space for everyone’s interests. There are non-coding roles in tech like Designing, Content Marketing, Customer Service, Social Media Management, Growth Management, Product Management, Technical Writing, Tech Journalism, Developers Relations, and so on. Some roles require coding like Software Engineering, Data Analysis, Engineering, Web Development, Systems Analysis and so on.</p>\n\n\n\n<p>Another exciting thing about getting a job in tech is you don’t have to settle on a role, you can just get started with basic tech skills and decide what to specialize in as you go!</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Time to learn tech skills</strong></h2>\n\n\n\n<p>Without a background in tech, tech can look complex. Don’t let that bother you. The next important thing to do when you are looking to start a career in the tech industry is to learn tech skills. To excel in your chosen role, you have to understand the language of the industry.</p>\n\n\n\n<p>Most times, your previous work experience, knowledge and current skills can be applied to the new career you are about to start in tech. This will make you stand out. It is also another important reason why you have to learn tech skills. You can decide to get a degree online or to look into learning new skills by attending boot camps or tech workshops. There are also easy-to-access resources on the internet. YouTube is an example of a great visual learning resource. There are also free tools like Codecademy Go, Py, Primer, KA Lite, Canva and so on that can assist you in getting hard skills in tech.</p>\n\n\n\n<p>Entry-level jobs like internship roles can get you some of the necessary tech skills too. Other training resource schools include Andela, where you can get paid to get trained as a world-class developer; Alt School Africa, where you can gain technical skills and become a force in Software Engineering; Lambda School Africa, where you can get trained to become a hireable quality developer in 9 months; IA Scholarship for Udacity; Coursera; and Replash, a free and mentor-led scholarship program for women who want to code.</p>\n\n\n\n<p>It is up to you to decide the kind of courses and programmes that will be great for the development of your tech skills.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Practise! Practise! Practise!</strong></h2>\n\n\n\n<p>You have to practise the new skills that you have learnt. That is one of the best ways to get started in technology. Try your hand at mini-projects. These mini projects can be side gigs that will pay you very little or nothing but it is up to you to decide if you want to do it for the experience and build your skills. Learning and practising will stretch your ability to test your new skill and knowledge.</p>\n\n\n\n<p>By doing this, you can start putting your portfolio together and this will help to get a job faster within the tech industry. While doing these mini-projects, remember to share your work on the internet.</p>\n\n\n\n<p>This will connect you to communities of women in tech that will be open to answering any questions you might have about a task, work with you or recommend you for jobs or collaborations.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Joining a community for women in tech</strong></h2>\n\n\n\n<p>Joining a community for women in tech at the beginning of your tech career is highly recommended. Getting started in tech can be a lot if you have to do it alone. The tech industry is a male-dominated space and as a woman in tech, it is possible to feel distant from the scene.</p>\n\n\n\n<p>A community will speed your growth in tech whether you are just getting started in tech or you have been in the space for a while. You can connect with newbies like you who you can learn new skills with while being accountable to one another. You can also connect with experienced women in tech who are willing to share their resources and answer whatever questions you might have. Communities like SheCode Africa, Women Techmakers, Women Who Code, She Designs and so on share resources with women in tech.</p>\n\n\n\n<p>Document Women spoke with&nbsp;<a href=\"https://documentwomen.com/for-shecode-africa-s-ada-nduka-oyom-community-is-key\">Ada Nduka Oyom</a>, who underscored the importance of community for women in tech. Between connecting and recommending women in tech to one another. A community can get you firsthand information about important meetups, conferences or webinars that can get you out there. You can develop new soft skills like networking through a community.&nbsp;</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Time to get this schmoney!&nbsp;</strong></h2>\n\n\n\n<p>You have done the work. Still doing the work. It is time to land the job of your dreams and get monetarily rewarded for your good job. Just know one of the myths in the tech industry is that once you get started in tech, you start swimming in money. Well… There is an active gender gap and pay gap in the industry and this is why you should research the standard pay for your role. Research the company you would like to work for to get a sense of their work culture and decide if it works for you. You have to decide on your ideal work environment. Don’t let your location limit you when it comes to searching for a job.&nbsp;</p>\n"},"posts":{"edges":[{"node":{"title":"What Does it Mean to Be a Customer Support Manager? Insights from Chimuanya Dike","excerpt":"<p>Customer support plays an important role in the tech industry, especially in tech companies. It is responsible for helping customers with questions, concerns, and issues related to the company&#8217;s products or services. Customer support professionals speak with their customers via phone, email, chat support, etc. In our tech world today, customer support is often integrated [&hellip;]</p>\n","slug":"what-does-it-mean-to-be-a-customer-support-manager-insights-from-chimuanya-dike","date":"2024-05-02T09:54:28","categories":{"edges":[{"node":{"name":"Dear Tech Sis","slug":"dear-tech-sis"}}]},"featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/CHIMUANYA_DIKE-scaled.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}}}},{"node":{"title":"Careers in Tech for Women to Pursue","excerpt":"<p> With access to free online courses, scholarships, and various learning resources, you can learn any tech skill of your choice. </p>\n","slug":"careers-in-tech-for-women-to-pursue","date":"2024-04-16T13:28:52","categories":{"edges":[{"node":{"name":"Dear Tech Sis","slug":"dear-tech-sis"}}]},"featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/04/magnet-me-JUpaXbh-Fgc-unsplash-scaled.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}}}},{"node":{"title":"5 Influential Women Making Waves in the Tech Industry","excerpt":"<p>Female talent from all across Africa, including Ghana, Kenya, Nigeria, and South Africa, are reshaping the technology narrative.</p>\n","slug":"5-influential-women-making-waves-in-the-tech-industry","date":"2024-04-02T12:00:00","categories":{"edges":[{"node":{"name":"Dear Tech Sis","slug":"dear-tech-sis"}}]},"featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/03/two-business-woman-cafe-scaled.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}}}},{"node":{"title":"Career Change; Transitioning From Law To Tech","excerpt":"<p>If you’re a woman in tech and would love to share a story, opinion piece, or anything at all with us, shoot us an email at thestackjournal@gmail.com! We’d love to hear from you. </p>\n","slug":"career-change-transitioning-from-law-to-tech","date":"2024-03-19T12:23:13","categories":{"edges":[{"node":{"name":"Dear Tech Sis","slug":"dear-tech-sis"}}]},"featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/03/pzenelq7yyrhhqsuwyjm.jpg"}},"author":{"node":{"name":"Oluwatobi Afolabi","firstName":"Oluwatobi","lastName":"Afolabi","avatar":{"url":"https://secure.gravatar.com/avatar/8a46aaa3e1f6249d3aac48b14f576580?s=96&d=mm&r=g"}}}}}]},"latest":{"edges":[{"node":{"title":"Startup Spotlight – Kola Market","excerpt":"<p>They help small and medium-sized businesses to drive sales all year round, increase their profits and grow sustainably.</p>\n","slug":"startup-spotlight-kola-market","date":"2024-05-08T08:05:38","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/274AC94E-2155-4C6E-9B08-EA8D4977C203.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Startups","slug":"startups","categoryId":5}}]},"tags":{"edges":[{"node":{"name":"Female-founder"}},{"node":{"name":"Founder"}},{"node":{"name":"Startup"}}]}}},{"node":{"title":"Meet Olajumoke Oduwole: Founder of KJK Africa ","excerpt":"<p>She has been trained in entrepreneurship and business management in nine top-notch accelerator programs and enterprise development centres in Africa and Europe.</p>\n","slug":"women-in-tech-olajumoke-oduwole","date":"2024-05-08T07:58:40","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/EDA185BF-30ED-418A-826C-07B542D1A034.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Founders","slug":"founders","categoryId":4}}]},"tags":{"edges":[{"node":{"name":"Female-founder"}},{"node":{"name":"Founder"}},{"node":{"name":"Startup"}}]}}},{"node":{"title":"Rose-Margaret Ekeng-Itua has become the first black woman to hold a PhD in Cybernetics","excerpt":"<p>An award-winning Nigerian Professor, Rose-Margaret Ekeng-Itua, has emerged as the first black woman in the world to earn a doctorate (PhD) in Cybernetics, which is the scientific study of control and communication in animals and machines, concerned with understanding complex systems like learning, cognition, adaptation, emergence, communication, and efficiency. Rose-Margaret is a pioneering educator, administrator, [&hellip;]</p>\n","slug":"rose-margaret-ekeng-itua-has-become-the-first-black-woman-to-hold-a-phd-in-cybernetics","date":"2024-05-07T18:05:21","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/IMG_1593.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"News","slug":"news","categoryId":8}}]},"tags":{"edges":[{"node":{"name":"Cybernetics"}},{"node":{"name":"News"}},{"node":{"name":"Tech"}}]}}},{"node":{"title":"Tech Sales vs Business Development","excerpt":"<p>Tech sales and Business development are important for generating revenue for companies in the tech industry. While both of them play the same role of contributing to the company’s growth, they do it in a different way and timeframe. Tech sales focus on closing deals with different customers, while business development creates new business opportunities [&hellip;]</p>\n","slug":"tech-sales-vs-business-development","date":"2024-05-07T14:56:20","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/joyful-successful-sales-agent-presenting-content-tablet-scaled.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Essays","slug":"essays","categoryId":1}}]},"tags":{"edges":[{"node":{"name":"Business Development"}},{"node":{"name":"Sales"}},{"node":{"name":"Tech"}}]}}},{"node":{"title":"The Stack Journal Launches Website for Women-Focused Tech News.","excerpt":"<p>According to Kiki Mordi, founder and CEO, The Stack Journal is forging partnerships with women in the tech industry.</p>\n","slug":"the-stack-journal-launches-website-for-women-focused-tech-news","date":"2024-05-02T09:56:59","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/96th-TSJ-7229.jpg"}},"author":{"node":{"name":"Kiki Mordi","firstName":"Kiki","lastName":"Mordi","avatar":{"url":"https://secure.gravatar.com/avatar/58f2fe88027e1ca7ef77f058feb3bde2?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"News","slug":"news","categoryId":8}}]},"tags":{"edges":[{"node":{"name":"Female-founder"}},{"node":{"name":"News"}},{"node":{"name":"Tech"}}]}}}]},"categories":{"edges":[{"node":{"name":"Awards","slug":"awards"}},{"node":{"name":"Dear Tech Sis","slug":"dear-tech-sis"}},{"node":{"name":"Essays","slug":"essays"}},{"node":{"name":"Events","slug":"events"}},{"node":{"name":"Founders","slug":"founders"}},{"node":{"name":"Industry Report","slug":"industry-report"}},{"node":{"name":"News","slug":"news"}},{"node":{"name":"Opportunities","slug":"opportunities"}},{"node":{"name":"Startups","slug":"startups"}},{"node":{"name":"uncategorized","slug":"uncategorized"}}]}},"__N_SSG":true}