{"pageProps":{"preview":false,"post":{"title":"Creating Support Groups For Women In Tech","excerpt":"<p>Half of the women working in STEM roles have experienced at least one of eight forms of gender discrimination.</p>\n","slug":"creating-support-groups-for-women-in-tech","date":"2022-04-30T12:00:05","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2022/04/otunleqjqdhiwmv6hxbc.jpg"}},"author":{"node":{"name":"Iyanuoluwa Adenle","firstName":"Iyanuoluwa","lastName":"Adenle","avatar":{"url":"https://secure.gravatar.com/avatar/aeeddafd589107b66a58882d645c7bd5?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Essays","slug":"essays","categoryId":1}}]},"tags":{"edges":[{"node":{"name":"Community"}},{"node":{"name":"STEM"}}]},"content":"\n<p>It’s hard to believe that tech used to be considered a female-dominated space, with how much things have changed in the last few decades. Today, women often feel alienated as a lot of policies which affect women working in tech, from hiring to career advancement, are largely influenced by gender stereotypes.</p>\n\n\n\n<p>Women working in STEM tend to experience discrimination, at their workplace, which includes a lack of access to the same opportunities and gender pay gap.  Some of these are the common pay gap, dismissal of women’s skill and competence in their job due to their gender, lack of support from their senior colleagues, and the lack of access to opportunities at work.&nbsp;</p>\n\n\n\n<p>While there are more conversations to be had about the underrepresentation of women in STEM roles, companies must create support groups and communities that are focused on women in the tech industry to increase women’s chances of excelling in the tech space.&nbsp;</p>\n\n\n\n<p>What would a support system within the tech community mean to you?</p>\n\n\n\n<p>“<em>I have my own support system. My sister is into tech and I have friends that are into tech too. Before I say what having a support system in my company would mean, how many women are even in tech in my company?</em> ”   – <strong>Dunni</strong>, a Junior Product Designer</p>\n\n\n\n<p>The Pew Research Center released data which stated that there are fewer women in tech because “women are sometimes treated fairly and sometimes treated unfairly when it comes to hiring or opportunities for advancement, while fewer than one-in-ten say that women are usually treated unfairly where they work during either process.” This often puts women off applying for tech roles.&nbsp;</p>\n\n\n\n<p>Half of the respondents the women said they had experienced gender discrimination in their workplace, while only 19 per cent of men said the same; 43 per cent of these male-dominated tech spaces noticed the gender diversity and this increased gender discrimination against women.&nbsp;</p>\n\n\n\n<p>Support groups within companies will help bridge the gender gap and pay gap arising from the prevalent gender stereotype in tech workplaces. Female tech communities like SheCodesAfrica, Women of Silicon Valley, Girls Who Code, Women in Technology International and so on, are usually non-profit <a href=\"https://techface.ch/female-tech-communities/\">organisations</a> for women in tech with the sole purpose of closing the gender gap in tech.&nbsp;</p>\n\n\n\n<p>The work of these female tech communities is important as they focus on connecting women in tech with technical and non-technical roles together, they provide <a href=\"https://builtin.com/women-tech\">resources</a> to help these women get better at their jobs, and they position members for jobs in the tech community.</p>\n\n\n\n<p>“<em>Support groups for women in tech can look like organisations putting healthcare structures in place like care packages for when women have their monthly periods, breastfeeding corners, paid and undisturbed maternity leave for women, zero-tolerance policy on sexual harassment, and taking their mental health seriously in the workplace.</em>”   – <strong>Deborah</strong>, a Human Resource professional.</p>\n\n\n\n<p><strong>Favour</strong>, a Product Manager also shares her experience:&nbsp; </p>\n\n\n\n<p>“<em>I have heard stories about how women are treated differently although I’ve never experienced it. So I will speak on support systems in general. There are so many support systems in tech but they aren’t accessible so I guess that defeats the purpose. When we talk about support systems, are we talking about career mentorship, technical support or support in trying to make women feel more comfortable? A support system for me, especially within a company, would mean that the growth in my career is considered, so paid courses. Something is always changing in tech. Grooming sessions, both technical, ethical, etc. The right workplace prioritises policies that protect women, equal pay, sexual harassment, maternity leave, promotions, etc</em> ”</p>\n\n\n\n<p>Companies should hire more women, collaborate with tech communities centred on women for their female employees and support them in their place of work. In 2020, the <a href=\"https://www.mckinsey.com/~/media/mckinsey/featured%20insights/diversity%20and%20inclusion/diversity%20wins%20how%20inclusion%20matters/diversity-wins-how-inclusion-matters-vf.pdf\">Mckinsey research</a> found that diverse and inclusive companies are likely to make better decisions, which they deemed a benefit during the Covid-19 crisis. The research focused on how companies invested in diversity might outperform their competitors or peers in the industry on the business front.</p>\n\n\n\n<p>They believe that representation has been slow in the ecosystem as more companies are not aware of the economic benefit of diversification. For a better and richer ecosystem, tech companies must invest in the women on their team, and the best way to start is to foster healthy support groups within the workplace.</p>\n\n\n\n<p>Support groups can take actions that would mean creating networks that will support the individual growth of women in tech. These groups will create and provide access to opportunities. They will encourage more women to enter the tech industry and take up technical and non-technical roles in the industry. Women usually make less than their male counterparts in the tech ecosystem as it is still largely male-dominated, and support groups for women in tech can step in to educate women on the value of their work in the ecosystem, teach them how to negotiate their wages and in the long run, close the gender pay gap.&nbsp;</p>\n\n\n\n<p>Groups within the tech community can act as a support system for women in tech and they know that whatever level they are in their career, they will always have the kind of support that keeps them focused and accountable.</p>\n"},"posts":{"edges":[{"node":{"title":"Annie Easley","excerpt":"<p>Annie Easley has contributed to STEM communities and broke down barriers for people of colour and women in STEM.</p>\n","slug":"annie-easley","date":"2022-02-05T12:00:37","categories":{"edges":[{"node":{"name":"Essays","slug":"essays"}}]},"featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/03/bc2sbii0bfzvsfvssvvr.jpg"}},"author":{"node":{"name":"Iyanuoluwa Adenle","firstName":"Iyanuoluwa","lastName":"Adenle","avatar":{"url":"https://secure.gravatar.com/avatar/aeeddafd589107b66a58882d645c7bd5?s=96&d=mm&r=g"}}}}}]},"latest":{"edges":[{"node":{"title":"Startup Spotlight – Kola Market","excerpt":"<p>They help small and medium-sized businesses to drive sales all year round, increase their profits and grow sustainably.</p>\n","slug":"startup-spotlight-kola-market","date":"2024-05-08T08:05:38","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/274AC94E-2155-4C6E-9B08-EA8D4977C203.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Startups","slug":"startups","categoryId":5}}]},"tags":{"edges":[{"node":{"name":"Female-founder"}},{"node":{"name":"Founder"}},{"node":{"name":"Startup"}}]}}},{"node":{"title":"Meet Olajumoke Oduwole: Founder of KJK Africa ","excerpt":"<p>She has been trained in entrepreneurship and business management in nine top-notch accelerator programs and enterprise development centres in Africa and Europe.</p>\n","slug":"women-in-tech-olajumoke-oduwole","date":"2024-05-08T07:58:40","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/EDA185BF-30ED-418A-826C-07B542D1A034.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Founders","slug":"founders","categoryId":4}}]},"tags":{"edges":[{"node":{"name":"Female-founder"}},{"node":{"name":"Founder"}},{"node":{"name":"Startup"}}]}}},{"node":{"title":"Rose-Margaret Ekeng-Itua has become the first black woman to hold a PhD in Cybernetics","excerpt":"<p>An award-winning Nigerian Professor, Rose-Margaret Ekeng-Itua, has emerged as the first black woman in the world to earn a doctorate (PhD) in Cybernetics, which is the scientific study of control and communication in animals and machines, concerned with understanding complex systems like learning, cognition, adaptation, emergence, communication, and efficiency. Rose-Margaret is a pioneering educator, administrator, [&hellip;]</p>\n","slug":"rose-margaret-ekeng-itua-has-become-the-first-black-woman-to-hold-a-phd-in-cybernetics","date":"2024-05-07T18:05:21","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/IMG_1593.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"News","slug":"news","categoryId":8}}]},"tags":{"edges":[{"node":{"name":"Cybernetics"}},{"node":{"name":"News"}},{"node":{"name":"Tech"}}]}}},{"node":{"title":"Tech Sales vs Business Development","excerpt":"<p>Tech sales and Business development are important for generating revenue for companies in the tech industry. While both of them play the same role of contributing to the company’s growth, they do it in a different way and timeframe. Tech sales focus on closing deals with different customers, while business development creates new business opportunities [&hellip;]</p>\n","slug":"tech-sales-vs-business-development","date":"2024-05-07T14:56:20","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/joyful-successful-sales-agent-presenting-content-tablet-scaled.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Essays","slug":"essays","categoryId":1}}]},"tags":{"edges":[{"node":{"name":"Business Development"}},{"node":{"name":"Sales"}},{"node":{"name":"Tech"}}]}}},{"node":{"title":"The Stack Journal Launches Website for Women-Focused Tech News.","excerpt":"<p>According to Kiki Mordi, founder and CEO, The Stack Journal is forging partnerships with women in the tech industry.</p>\n","slug":"the-stack-journal-launches-website-for-women-focused-tech-news","date":"2024-05-02T09:56:59","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/96th-TSJ-7229.jpg"}},"author":{"node":{"name":"Kiki Mordi","firstName":"Kiki","lastName":"Mordi","avatar":{"url":"https://secure.gravatar.com/avatar/58f2fe88027e1ca7ef77f058feb3bde2?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"News","slug":"news","categoryId":8}}]},"tags":{"edges":[{"node":{"name":"Female-founder"}},{"node":{"name":"News"}},{"node":{"name":"Tech"}}]}}}]},"categories":{"edges":[{"node":{"name":"Awards","slug":"awards"}},{"node":{"name":"Dear Tech Sis","slug":"dear-tech-sis"}},{"node":{"name":"Essays","slug":"essays"}},{"node":{"name":"Events","slug":"events"}},{"node":{"name":"Founders","slug":"founders"}},{"node":{"name":"Industry Report","slug":"industry-report"}},{"node":{"name":"News","slug":"news"}},{"node":{"name":"Opportunities","slug":"opportunities"}},{"node":{"name":"Startups","slug":"startups"}},{"node":{"name":"uncategorized","slug":"uncategorized"}}]}},"__N_SSG":true}