{"pageProps":{"preview":false,"post":{"title":"Empowering Startups: Ized Uanikhehi’s Insights On Digital Marketing","excerpt":"<p>She is the Co-founder of Zedi Africa, a digital marketing startup for African startups; HireFoster.</p>\n","slug":"empowering-startups-ized-uanikhehis-insights-on-digital-marketing","date":"2022-07-30T12:00:00","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/03/m2ouccogr2fiivkxxj9s.jpg"}},"author":{"node":{"name":"Iyanuoluwa Adenle","firstName":"Iyanuoluwa","lastName":"Adenle","avatar":{"url":"https://secure.gravatar.com/avatar/aeeddafd589107b66a58882d645c7bd5?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Founders","slug":"founders","categoryId":4}}]},"tags":{"edges":[{"node":{"name":"Digital-Marketing"}},{"node":{"name":"Startup"}},{"node":{"name":"Tech"}}]},"content":"\n<p>Ized Uanikhehi is a badass marketing strategist with over fifteen years of experience in technology, marketing, and digital media. Over the past seven years, she has changed the African digital marketing landscape by adopting technology for advocacy and assisting startups in promoting their businesses.</p>\n\n\n\n<p>She is the Co-founder of Zedi Africa, a digital marketing startup for African startups; HireFoster, a consulting agency in charge of recruiting excellent recruiters; and Tora Africa, a human resource tech company for tech startups. She is also the Chief Marketing Officer at HAUL247, an end-to-end logistics e-platform.&nbsp;</p>\n\n\n\n<p>In this interview, Ized shares her experience as a digital marketer for startups, the challenges of being a female founder in the startup scene, raising funds from international investors, and her next project.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Hello, Ized! Please introduce yourself and tell us about what you do.</strong></h2>\n\n\n\n<p>My name is Ized Uanikhehi, Co-founder of Zedi Africa, and HireFoster. I’m the CEO at a MarTech marketing agency (Zedi Africa) focused on a niche clientele of startups. We provide 360 degrees growth marketing services for startups (offline and digital) to achieve their marketing goals.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>How did you get into the tech industry?</strong></h2>\n\n\n\n<p>Although I studied Biochemistry, I’ve pretty much done marketing/sales for a while, mostly because that has always been my passion and where I migrate to regardless of what I was hired for in any company.</p>\n\n\n\n<p>I got bitten by the digital marketing bug when a friend helped me share a post online and my sales quadrupled in a short time. I got fascinated and started to learn more about it. That’s how I got into the tech part of marketing, since then it has been a rollercoaster ride of gathering more experience on the job, learning, and doing. Currently building my own Marketing tech tool.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>You have co-founded several startups, including Tora Africa &#8211; a human resource tech company for tech startups- and recently, Zedi Africa &#8211; a digital marketing startup for African startups. What inspired you to start Zedi Africa?</strong></h2>\n\n\n\n<p>I’ve found out that a lot of startup founders start out with really good ideas, but one of the reasons they don’t do well is because they don’t have marketing on lockdown. A lot of them expect that because they have a great or very innovative solution, the clients will knock down their doors and so they don’t particularly ensure that their marketing is great. But it soon hits them, more often than not too late that they need to ensure that their marketing is done properly and right.</p>\n\n\n\n<p>I was inspired to start Zedi Africa as a way to provide marketing for startups because they are a niche market that needs to absolutely grow. 90% of startups fail and 68% of that can be traced to marketing not done right especially for African startups.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>We know that Zedi Africa is not your first startup. Can you tell us a little more about building startups and some of the lessons you have learnt on that journey?</strong></h2>\n\n\n\n<p>This is one interesting question.</p>\n\n\n\n<p>I think one of the critical things I’ve learned is that you can fail forward and that the fear of failure shouldn’t hinder you from doing what you need to do as long as you take the lesson &amp; experience and do better.</p>\n\n\n\n<p>‘Tora failed’, mostly because there was the okada ban which was where the company was hinged on but more so because we couldn’t pivot fast enough.</p>\n\n\n\n<p>So another thing I’ve learned is to be as nimble as possible as a startup. A lot of startups start out as one thing and then grow into something else, so founders should have the expectation that what they started out as might be different from where they are going. So be nimble, flexible, and able to pivot faster.</p>\n\n\n\n<p>Every member of your team is as critical to your startup’s growth as the solution you’re providing.</p>\n\n\n\n<p>Ensure you’re picking your teammates not just for the smarts but also for a culture fit. They need to be just as dedicated and motivated as you are because that is critical to driving growth.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What are some of the challenges you have faced in the tech industry as a female startup founder and a digital marketer for startups?</strong></h2>\n\n\n\n<p>A lot of women face challenges as female startup founders, but I didn’t face a lot of those, until now. Starting Zedi and having to raise money from international investors and VCs, I’ve found out that women are not given enough attention as male founders.</p>\n\n\n\n<p>There are not enough women on the VC tables, especially those that will fund a niche market like ours that you’re trying to raise funds from and so you don’t get presented the same opportunity a male counterpart with not as good ideas as yours is given.</p>\n\n\n\n<p>So I find it harder for female founders to raise funds from VCs than if they were men.</p>\n\n\n\n<p>Also as a digital marketer for startups is that startups come to the marketers too late and expect Magic, you would see a startup that has been operational for a year with only 200- active customers telling you they want 100,000 active users in one month, even that will be fine if they had the budget for it but they usually do not, I like that people think we are magician though.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>How did you tackle some of these challenges?</strong></h2>\n\n\n\n<p>I do the work. I’ve built a habit of going for what I want and celebrating my wins (little or big). We’re as capable as a male counterpart to crush all those goals.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What is your perspective on getting more women into tech?</strong></h2>\n\n\n\n<p>I’ve always said that community is important and critical in bringing a lot more women into tech. Regardless of where women are at now, the community of women already in tech is critical to encourage other women to get into tech to drive growth together.</p>\n\n\n\n<p>I believe in the principle of UBUNTU, that I am who I am because of who you are and the community is essential for everyone’s growth— individual and industry-based growth.</p>\n\n\n\n<p>There are a lot of opportunities for women in tech these days, not necessarily just coding. So women need to be more assertive about getting into these senior roles and intentional with getting other women into the tech when they are in those senior roles.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Are you working on any new stuff we can look out for?</strong></h2>\n\n\n\n<p>Yes, I’m working on GrowthStack, a semi-automated end-end no code 360-degree marketing automation platform for startups to be able to automate their marketing at any time they need it without necessarily needing the expertise and pay only for what they want/need to drive growth without paying retainers (they only pay for what they need).</p>\n\n\n\n<p>I’m super excited about it and looking forward to its launch sometime towards the end of the year.</p>\n"},"posts":{"edges":[{"node":{"title":"Meet Olajumoke Oduwole: Founder of KJK Africa ","excerpt":"<p>She has been trained in entrepreneurship and business management in nine top-notch accelerator programs and enterprise development centres in Africa and Europe.</p>\n","slug":"women-in-tech-olajumoke-oduwole","date":"2024-05-08T07:58:40","categories":{"edges":[{"node":{"name":"Founders","slug":"founders"}}]},"featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/EDA185BF-30ED-418A-826C-07B542D1A034.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}}}},{"node":{"title":"Meet Damilola Odufuwa: Co-founder of Backdrop","excerpt":"<p>She is the co-founder of Backdrop, an Al-powered travel app and social network helping people easily find and share beautiful places.</p>\n","slug":"damilola-odufuwa-co-founder-backdrop","date":"2024-04-22T12:02:49","categories":{"edges":[{"node":{"name":"Founders","slug":"founders"}}]},"featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/04/WhatsApp-Image-2024-04-22-at-11.54.25_92ee63ac.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}}}},{"node":{"title":"Meet Tomilola Majekodunmi: CEO/Co-founder of Bankly","excerpt":"<p>Tomilola&#8217;s journey towards financial inclusion began with a collaboration on a product named SmartCredit.</p>\n","slug":"meet-tomilola-majekodunmi-ceo-co-founder-of-bankly","date":"2024-04-22T09:30:59","categories":{"edges":[{"node":{"name":"Founders","slug":"founders"}}]},"featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/04/WhatsApp-Image-2024-04-22-at-09.20.39_daa90ffa.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}}}},{"node":{"title":"Meet Yanmo Omorogbe: COO/Co-founder of Bamboo","excerpt":"<p>Yanmo aims to simplify investment and make it accessible to Africans, enabling them to grow their personal wealth.</p>\n","slug":"meet-yanmo-omorogbe-coo-co-founder-bamboo","date":"2024-04-16T19:42:14","categories":{"edges":[{"node":{"name":"Founders","slug":"founders"}}]},"featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/04/WhatsApp-Image-2024-04-16-at-19.35.53_f8328019.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}}}}]},"latest":{"edges":[{"node":{"title":"Startup Spotlight – Kola Market","excerpt":"<p>They help small and medium-sized businesses to drive sales all year round, increase their profits and grow sustainably.</p>\n","slug":"startup-spotlight-kola-market","date":"2024-05-08T08:05:38","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/274AC94E-2155-4C6E-9B08-EA8D4977C203.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Startups","slug":"startups","categoryId":5}}]},"tags":{"edges":[{"node":{"name":"Female-founder"}},{"node":{"name":"Founder"}},{"node":{"name":"Startup"}}]}}},{"node":{"title":"Meet Olajumoke Oduwole: Founder of KJK Africa ","excerpt":"<p>She has been trained in entrepreneurship and business management in nine top-notch accelerator programs and enterprise development centres in Africa and Europe.</p>\n","slug":"women-in-tech-olajumoke-oduwole","date":"2024-05-08T07:58:40","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/EDA185BF-30ED-418A-826C-07B542D1A034.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Founders","slug":"founders","categoryId":4}}]},"tags":{"edges":[{"node":{"name":"Female-founder"}},{"node":{"name":"Founder"}},{"node":{"name":"Startup"}}]}}},{"node":{"title":"Rose-Margaret Ekeng-Itua has become the first black woman to hold a PhD in Cybernetics","excerpt":"<p>An award-winning Nigerian Professor, Rose-Margaret Ekeng-Itua, has emerged as the first black woman in the world to earn a doctorate (PhD) in Cybernetics, which is the scientific study of control and communication in animals and machines, concerned with understanding complex systems like learning, cognition, adaptation, emergence, communication, and efficiency. Rose-Margaret is a pioneering educator, administrator, [&hellip;]</p>\n","slug":"rose-margaret-ekeng-itua-has-become-the-first-black-woman-to-hold-a-phd-in-cybernetics","date":"2024-05-07T18:05:21","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/IMG_1593.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"News","slug":"news","categoryId":8}}]},"tags":{"edges":[{"node":{"name":"Cybernetics"}},{"node":{"name":"News"}},{"node":{"name":"Tech"}}]}}},{"node":{"title":"Tech Sales vs Business Development","excerpt":"<p>Tech sales and Business development are important for generating revenue for companies in the tech industry. While both of them play the same role of contributing to the company’s growth, they do it in a different way and timeframe. Tech sales focus on closing deals with different customers, while business development creates new business opportunities [&hellip;]</p>\n","slug":"tech-sales-vs-business-development","date":"2024-05-07T14:56:20","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/joyful-successful-sales-agent-presenting-content-tablet-scaled.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Essays","slug":"essays","categoryId":1}}]},"tags":{"edges":[{"node":{"name":"Business Development"}},{"node":{"name":"Sales"}},{"node":{"name":"Tech"}}]}}},{"node":{"title":"The Stack Journal Launches Website for Women-Focused Tech News.","excerpt":"<p>According to Kiki Mordi, founder and CEO, The Stack Journal is forging partnerships with women in the tech industry.</p>\n","slug":"the-stack-journal-launches-website-for-women-focused-tech-news","date":"2024-05-02T09:56:59","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/96th-TSJ-7229.jpg"}},"author":{"node":{"name":"Kiki Mordi","firstName":"Kiki","lastName":"Mordi","avatar":{"url":"https://secure.gravatar.com/avatar/58f2fe88027e1ca7ef77f058feb3bde2?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"News","slug":"news","categoryId":8}}]},"tags":{"edges":[{"node":{"name":"Female-founder"}},{"node":{"name":"News"}},{"node":{"name":"Tech"}}]}}}]},"categories":{"edges":[{"node":{"name":"Awards","slug":"awards"}},{"node":{"name":"Dear Tech Sis","slug":"dear-tech-sis"}},{"node":{"name":"Essays","slug":"essays"}},{"node":{"name":"Events","slug":"events"}},{"node":{"name":"Founders","slug":"founders"}},{"node":{"name":"Industry Report","slug":"industry-report"}},{"node":{"name":"News","slug":"news"}},{"node":{"name":"Opportunities","slug":"opportunities"}},{"node":{"name":"Startups","slug":"startups"}},{"node":{"name":"uncategorized","slug":"uncategorized"}}]}},"__N_SSG":true}