{"pageProps":{"preview":false,"post":{"title":"First Check; Providing Funding For African Female Founders","excerpt":"<p>Their mission with FirstCheck is to fix capital access for female tech entrepreneurs in Africa with a female-led approach as a female-led investor community.</p>\n","slug":"first-check-providing-funding-for-african-female-founders","date":"2022-05-21T12:00:00","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/03/gk71mjojmaxmotmzssxp.jpg"}},"author":{"node":{"name":"Iyanuoluwa Adenle","firstName":"Iyanuoluwa","lastName":"Adenle","avatar":{"url":"https://secure.gravatar.com/avatar/aeeddafd589107b66a58882d645c7bd5?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Essays","slug":"essays","categoryId":1}}]},"tags":{"edges":[{"node":{"name":"African"}},{"node":{"name":"Female-founder"}}]},"content":"\n<p>It is no secret that the tech sector is largely male-dominated. This has caused a lot of concern in the past few years as various reports on diversity, pay gaps, and discrimination continue to surface.&nbsp;</p>\n\n\n\n<p>However, a particularly troubling phenomenon that women founders of startups face during valuation is the venture capital associate bias against women founders in the venture capital industry. Women-founded startups in Africa have been receiving only 1 per cent of venture capital funding since 2011. When it comes to funding in Africa, the trend has been that startups founded by men receive much more on average than those founded or co-founded by women, hence the wealth gap for women in the VC industry and beyond.</p>\n\n\n\n<p>According to some early-stage founders,&nbsp;<a href=\"https://techcrunch.com/2022/01/19/why-arent-female-founders-getting-a-bigger-piece-of-the-pie-theories-abound/?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAACQRxiD4mYvJjW0F-CFBdR4mUOUcvOpeo35Z6c-bsZ65KPOJV69euN0yiX9UycwRu0PR5fAyfKPLpdA0qF0e9MNVE_Cvi-omLi9iDbpwe4sC0PWZf21TgHGLQYeeApw6DkZLdGoMB1CwBEt0ebNWaXG22AaRa-RmSl3geHah57s3\">venture capitalists</a>&nbsp;aren’t nearly as helpful as they could be for startups from underrepresented groups. Now, imagine being a female founder/co-founder in Africa. A new Briter Bridges report revealed that out of the 122 startups that received investment funding between 2013 and 2018, only 23 startups or 17 per cent of all startups had at least one female founder. That means that a lot more male entrepreneurs are being funded than their female counterparts. Some early-stage founders have identified the problem as systemic misogyny as VCs like to ‘virtue signal’ and talk about how they are helping women-led startups but don’t put their money where their mouths are.&nbsp;</p>\n\n\n\n<p>While the number of women-led startups is on the rise, opportunities for women to get venture funding continue to&nbsp;<a href=\"https://businessday.ng/technology/article/eight-reasons-female-founded-startups-get-the-least-funding/\">dwindle</a>, even with more women starting companies than men. According to&nbsp;<a href=\"https://wappp.hks.harvard.edu/venture-capital-and-entrepreneurship\">CB Insights</a>, among VC firms that invest $10 million or more in startups, just 13 per cent of partners are women. As the venture capital industry is heavily dominated by men, women-led startups have to search for funds outside the sector, however, this is not an ideal situation. This means that women-led startups have to search for funds to run their startups in the most cost-effective ways possible if VCs won’t fund their businesses. They have to resort to other traditional methods of sourcing funds like loans/mortgages, peer-to-peer lending, borrowing from friends and family, offering their own personal assets as collateral, and so on.&nbsp;</p>\n\n\n\n<p>Eloho Omame and Odunayo Eweniyi started FirstCheck Africa, a female-focused angel fund, to address the obvious gender gap in tech in Africa by investing in women entrepreneurs. Given the under-representation of female tech founders on the continent and the gender-gap present in the VC funding process, these women are helping to advance equity, capital, and leadership for a generation of African women. Their&nbsp;<a href=\"https://firstcheckhq.medium.com/announcing-firstcheck-africa-dbc72b1f7180\">mission</a>&nbsp;with FirstCheck is to fix capital access for female tech entrepreneurs in Africa with a female-led approach as a female-led investor community.&nbsp;</p>\n\n\n\n<p>In 2021, they announced their first four portfolio female-led startup companies: Foondamate (South Africa), Healthtracka (Nigeria), Tushop (Kenya), and Zoie Health (South Africa). At the end of their first year, 2021, they wrote:</p>\n\n\n\n<p><em>“We’re invested in Nigeria, Kenya, South Africa and Egypt. We did our first follow-on and made our first two seed-stage investments. We’ve also tweaked and evolved our model: we’re now a pre-seed and seed-stage fund with the capacity to write checks of $25K and above. We’re better able to serve female founders that way. We’ll keep pushing until we’re the preferred early-stage investor for diverse founding teams on the continent.”</em></p>\n\n\n\n<p>To provide access to capital for female entrepreneurs, Omame and Eweniyi have created FirstCheck, a platform that includes an organised effort to provide access to capital for female founders from diverse sectors across Africa. These efforts range from leveling the playing field for female founders with their straightforward application form to encouraging pitches from female founders across different sectors like Agriculture, Real Estate and so on. The FirstCheck team offers support like working sessions with experts that will help new startup female-founders to build better businesses, reviewing companies’ portfolios to ease them through the fundraising process, and building a community for these founders.&nbsp;</p>\n\n\n\n<p>Funding is important for startups to grow, mature and work at an optimal rate. The lack of funding for these women-led startups will slow down the growth rate of the business and focus on new product development will be directed towards raising additional funds. It will also mean that operational expenses are strained. When a business is scrambling for cash flow, it can create a downward momentum and make future fundraising increasingly difficult.&nbsp;</p>\n\n\n\n<p>In other words, venture capitalists play a critical role in deciding which ideas and innovations can shape our economy and society, and when they routinely fund men over women, this sets the entire industry back. This is why the work of Omame and Eweniyi’s with FirstCheck Africa is clear. To&nbsp;<a href=\"https://techcrunch.com/2021/01/26/these-investors-want-to-back-ridiculously-early-female-led-african-startups/\">bridge the gender funding gap</a>&nbsp;for female-led startups in Africa, FirstCheck partners with other local and international investors aimed at supporting women in business development.&nbsp;</p>\n\n\n\n<p>Reviewing the progress made at FirstCheck in 2021, they wrote:</p>\n\n\n\n<p><em>“Last year, we wanted to prove that women are building in tech. FirstCheck Africa received, on average, a funding application a day from startups founded or co-founded by women in more than 15 countries. We listened to six pitches a month from startups led by women. They are building B2B and B2C products in multiple sectors, including fintech, edtech, health tech and retail/commerce.”</em></p>\n\n\n\n<p>FirstCheck has built and is still working on building the community that will assist and support women-led ventures by writing checks for them. We believe this is one way in which women can be more involved with starting businesses and making a positive impact on Africa’s economy.&nbsp;</p>\n"},"posts":{"edges":[]},"latest":{"edges":[{"node":{"title":"Startup Spotlight – Kola Market","excerpt":"<p>They help small and medium-sized businesses to drive sales all year round, increase their profits and grow sustainably.</p>\n","slug":"startup-spotlight-kola-market","date":"2024-05-08T08:05:38","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/274AC94E-2155-4C6E-9B08-EA8D4977C203.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Startups","slug":"startups","categoryId":5}}]},"tags":{"edges":[{"node":{"name":"Female-founder"}},{"node":{"name":"Founder"}},{"node":{"name":"Startup"}}]}}},{"node":{"title":"Meet Olajumoke Oduwole: Founder of KJK Africa ","excerpt":"<p>She has been trained in entrepreneurship and business management in nine top-notch accelerator programs and enterprise development centres in Africa and Europe.</p>\n","slug":"women-in-tech-olajumoke-oduwole","date":"2024-05-08T07:58:40","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/EDA185BF-30ED-418A-826C-07B542D1A034.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Founders","slug":"founders","categoryId":4}}]},"tags":{"edges":[{"node":{"name":"Female-founder"}},{"node":{"name":"Founder"}},{"node":{"name":"Startup"}}]}}},{"node":{"title":"Rose-Margaret Ekeng-Itua has become the first black woman to hold a PhD in Cybernetics","excerpt":"<p>An award-winning Nigerian Professor, Rose-Margaret Ekeng-Itua, has emerged as the first black woman in the world to earn a doctorate (PhD) in Cybernetics, which is the scientific study of control and communication in animals and machines, concerned with understanding complex systems like learning, cognition, adaptation, emergence, communication, and efficiency. Rose-Margaret is a pioneering educator, administrator, [&hellip;]</p>\n","slug":"rose-margaret-ekeng-itua-has-become-the-first-black-woman-to-hold-a-phd-in-cybernetics","date":"2024-05-07T18:05:21","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/IMG_1593.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"News","slug":"news","categoryId":8}}]},"tags":{"edges":[{"node":{"name":"Cybernetics"}},{"node":{"name":"News"}},{"node":{"name":"Tech"}}]}}},{"node":{"title":"Tech Sales vs Business Development","excerpt":"<p>Tech sales and Business development are important for generating revenue for companies in the tech industry. While both of them play the same role of contributing to the company’s growth, they do it in a different way and timeframe. Tech sales focus on closing deals with different customers, while business development creates new business opportunities [&hellip;]</p>\n","slug":"tech-sales-vs-business-development","date":"2024-05-07T14:56:20","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/joyful-successful-sales-agent-presenting-content-tablet-scaled.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Essays","slug":"essays","categoryId":1}}]},"tags":{"edges":[{"node":{"name":"Business Development"}},{"node":{"name":"Sales"}},{"node":{"name":"Tech"}}]}}},{"node":{"title":"The Stack Journal Launches Website for Women-Focused Tech News.","excerpt":"<p>According to Kiki Mordi, founder and CEO, The Stack Journal is forging partnerships with women in the tech industry.</p>\n","slug":"the-stack-journal-launches-website-for-women-focused-tech-news","date":"2024-05-02T09:56:59","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/96th-TSJ-7229.jpg"}},"author":{"node":{"name":"Kiki Mordi","firstName":"Kiki","lastName":"Mordi","avatar":{"url":"https://secure.gravatar.com/avatar/58f2fe88027e1ca7ef77f058feb3bde2?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"News","slug":"news","categoryId":8}}]},"tags":{"edges":[{"node":{"name":"Female-founder"}},{"node":{"name":"News"}},{"node":{"name":"Tech"}}]}}}]},"categories":{"edges":[{"node":{"name":"Awards","slug":"awards"}},{"node":{"name":"Dear Tech Sis","slug":"dear-tech-sis"}},{"node":{"name":"Essays","slug":"essays"}},{"node":{"name":"Events","slug":"events"}},{"node":{"name":"Founders","slug":"founders"}},{"node":{"name":"Industry Report","slug":"industry-report"}},{"node":{"name":"News","slug":"news"}},{"node":{"name":"Opportunities","slug":"opportunities"}},{"node":{"name":"Startups","slug":"startups"}},{"node":{"name":"uncategorized","slug":"uncategorized"}}]}},"__N_SSG":true}