{"pageProps":{"preview":false,"post":{"title":"For SheCode Africa’s Ada Nduka Oyom, Community Is Key","excerpt":"<p>She founded SCA in 2016 and has since impacted over 17,000 women members across 20+ African countries with her team while championing gender diversity in tech through it.</p>\n","slug":"for-shecode-africas-ada-nduka-oyom-community-is-key","date":"2022-07-02T12:00:00","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/03/v8y1qhs2kramlfvxtm4z.jpg"}},"author":{"node":{"name":"Iyanuoluwa Adenle","firstName":"Iyanuoluwa","lastName":"Adenle","avatar":{"url":"https://secure.gravatar.com/avatar/aeeddafd589107b66a58882d645c7bd5?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Founders","slug":"founders","categoryId":4}}]},"tags":{"edges":[{"node":{"name":"Community"}},{"node":{"name":"Female-founder"}}]},"content":"\n<p>Ada Nduka Oyom is the founder of She Code Africa (SCA), a non-profit organisation focused on empowering young girls and women in Africa through technical skills. She founded SCA in 2016 and has since impacted over 17,000 women members across 20+ African countries with her team while championing gender diversity in tech through it.</p>\n\n\n\n<p>The Stack Journal had a conversation with her about the importance of building a community for women in the tech industry.&nbsp;</p>\n\n\n\n<p><strong>Hi Ada! Tell us a bit about yourself.</strong>&nbsp;</p>\n\n\n\n<p>Hi! My name is Ada Nduka Oyom, and I am the founder of She Code Africa, a nonprofit organisation for women in tech within Africa. I am a gender equality advocate, and also a strong advocate for getting more women into tech.</p>\n\n\n\n<p>Asides from that, I am also a community manager and a Developer Relations professional. I help build developer communities for Google for Sub-Saharan Africa, and I am also the co-founder of Open Source Community Africa. I am largely invested in building developer communities and making sure that the works of African developers or Africans in tech are amplified and highlighted in the global tech ecosystem.</p>\n\n\n\n<p>I’m also a content creator. I create tech content on TikTok.&nbsp;</p>\n\n\n\n<p><strong>Let’s talk about the importance of community for women in tech</strong></p>\n\n\n\n<p>I know what communities have done for me personally. Communities have had a huge impact on my career growth. I know that without the different committees that I was involved in while starting, I wouldn&#8217;t be where I am today, which is one of the reasons that I decided to start She Code Africa.&nbsp;</p>\n\n\n\n<p>I studied microbiology and while transitioning into tech, community was instrumental in helping me grow in my role. For women getting into tech, communities are important because you get to meet other women in tech. It’s a diverse ecosystem that is largely dominated by men, and it&#8217;s often common to feel intimidated or overwhelmed with all the resources, tools, and platforms.</p>\n\n\n\n<p>It’s not uncommon to feel like you don’t belong, because you can&#8217;t relate to certain things just because there aren’t as many women.&nbsp;</p>\n\n\n\n<p>Even in communities where there are women, it&#8217;s often women of other races and as a Black or African woman in tech, it can be difficult to thrive in an ecosystem like that. So, communities help, especially for African women.&nbsp; It creates that sense of togetherness, a much-needed platform where you meet women like you, who can relate to most of the things you experience.&nbsp;</p>\n\n\n\n<p>One beautiful thing about being part of a community is that it spurs you towards growth because you&#8217;ve seen women do things that you never imagined were achievable. It plays a significant part in your sense of development in whatever field in tech you&#8217;re pursuing.</p>\n\n\n\n<p><strong>Would you give us some insight on what kind of communities you found useful when you first started, especially as a woman?</strong></p>\n\n\n\n<p>When I started my career in tech, in my second year, I attended an event. That was the first entrance or activity that brought me into the tech ecosystem or anything that has to revolve around tech itself. I started attending more community events, and it started with student developer communities.</p>\n\n\n\n<p>I then started leading the student developer community in my school via the Google Developer Groups programme, and then from there, I noticed that there weren’t so many women attendees, with Google running a Women Techmakers(WTM) programme, I decided to also become a WTM ambassador, and start a community of women in tech within my university, especially female student developers.&nbsp;</p>\n\n\n\n<p>Those communities played a significant role in my career because as a community leader, it exposed me to other people who were also building the same sort of communities in their respective locations, including outside the country.&nbsp;</p>\n\n\n\n<p>Having that level of exposure made me see different perspectives. Dev communities, communities for community managers, and other communities for different tech roles also played an important part for me.</p>\n\n\n\n<p>After I graduated from school, I signed up on Free Code Camp and started learning from there. But I will never underestimate the impact that the GDG &#8211; The Google Developer Groups &#8211; and Women Techmakers had on me. The background I got from there helped me kick off the communities that I lead today, including She Code Africa and Open Source Community Africa.&nbsp;</p>\n\n\n\n<p><strong>What inspired you to start She Code Africa?</strong></p>\n\n\n\n<p>&nbsp;I started She Code Africa because of my experience and the opportunities to lead communities in school and to interact with other community builders, especially women.&nbsp; These women were doing amazing in tech and building communities within the tech ecosystem in Nigeria and outside Nigeria. I graduated in 2016 and in September, World Programmers was being celebrated and it was just one company that spotlighted one black African woman. In my mind, I thought, “That&#8217;s not fair.”&nbsp;</p>\n\n\n\n<p>This was because I had interacted with so many amazing women who didn’t have that platform to tell the rest of the world about the cool things they are doing. So I decided that I was going to start something. And I did.&nbsp;</p>\n\n\n\n<p>She Code Africa started from that idea, which manifested in me publishing articles on Medium. I would reach out to my friends, women who were doing great in their careers, ask them specific questions, draft it into a story, and then post it on my Medium page. It started gaining significant traction. I wasn&#8217;t so active on Twitter then, but I would post them on Facebook and people would reach out, comment and all of that.&nbsp;&nbsp;</p>\n\n\n\n<p>Soon, people started asking questions about getting started in tech because some of these women had inspired them a lot. It got me thinking about my experience in running communities and curating events as I did back in school. It felt like the right time to start free training events for these women. With my non-traditional background in tech, access to resources was a huge problem for me when I first started because I could not afford to get learning resources for myself. So I knew the kind of issues that women, especially African women, face when they get into tech. I decided that&nbsp; I was going to provide free resources, even if it meant getting volunteers as facilitators.&nbsp;</p>\n\n\n\n<p>That was how She Code Africa morphed from a women-only publication platform into a training platform and a community. From there, I made up my mind to turn it into an organisation. I had a vision for what I wanted to do, which was to take She Code Africa, a series on Medium into an organisation that runs technical programmes for women in tech. To also create a community for these women to connect And network, just so that while they&#8217;re learning, they&#8217;re also networking with one another.</p>\n\n\n\n<p>This was in 2016. We started to take things more seriously by making it official and creating a structure two years after we began She Code Africa.&nbsp; In 2018, when we started the actual community platform which has now grown to over 16,000 women from ground zero.&nbsp;</p>\n\n\n\n<p><strong>That’s pretty amazing. You’re building other communities as well: DevRelLite and OSCA. Tell us a little about that?</strong></p>\n\n\n\n<p>&nbsp;Yes, I am building another community apart from She Code Africa, it is called Open Source Community Africa, and I&#8217;m also running an initiative called DevRel Lite because I&#8217;m primarily a DevRel professional with more focused on community management and program management.</p>\n\n\n\n<p>Now and then, I get inquiries from people who are looking to get into DevRel. With my schedules and existing commitments, I knew that I couldn’t just start another community, so I decided to start a platform where I can share my experience and bring people in to do the same for anybody interested in getting into the field, That was how DevRel Lite started.&nbsp;</p>\n\n\n\n<p>Open Source Community Africa, OSCA, started around 2018 and the story of how it started is almost similar to She Code Africa.&nbsp; I have a friend who is now the co-founder of OSCAs, Samson Goddy. Samson has been doing amazing things in the open source space. With my experience in building communities and Samson’s knowledge of the open-source, we decided to grow a community of people who are actively contributing to open source.</p>\n\n\n\n<p>We now run an annual festival, OSCA-fest which is our headline event, and we have multiple chapters. The primary goal is to make sure that we are evangelizing open source in Africa and building credible contributors from Africa, contributing to the global open source ecosystem.&nbsp;</p>\n\n\n\n<p><strong>Talk us through your journey in the tech space. What are some of the greatest things you’ve seen but also challenges you have faced since you began?</strong>&nbsp;</p>\n\n\n\n<p>To be very honest, I&#8217;ve seen a lot! But one beautiful thing that I would forever appreciate about getting into tech is the kind of mindset that it has given me. The mindset is that&nbsp; I&#8217;m not limited to anything when it comes to my dreams and everything is achievable if I&#8217;m willing to put in the kind of effort that it requires.</p>\n\n\n\n<p>When I compare my mentality and perspectives of where I am coming from to where I am, there is a contrast and there are two different characters. I like that I have been able to meet so many people since I got into tech. There are some fields in non-tech sectors where you know that this is the peak of your career, but when it comes to tech, it is limitless. I could start as a software engineer and retire as a founder.&nbsp;</p>\n\n\n\n<p>Some of the challenges I face evolve from time to time, based on my situation and where I am in my career. There was the initial lack of access to resources when I started and I couldn’t even buy a laptop to practice what I was learning. Then I couldn’t get a suitable job for the kind of lifestyle that I wanted to live. Later in my career, I started running She Code Africa and the challenge of “I don&#8217;t know a lot about running an org” presented itself.&nbsp;</p>\n\n\n\n<p>As a nonprofit founder, I felt I didn’t have that orientation that some for-profit founders get to have, maybe from like a startup school or something. There was a lot of trial and error, a lot!. I learnt how to become a leader from experience, not because somebody sponsored me or took me to a leadership school.</p>\n\n\n\n<p>To me, at every phase in my career, these different challenges have taken the spotlight. Also, one of the downsides of tech is suffering from burnout, especially if you’re running too many things at once, like being a&nbsp; founder. You have to be very careful to avoid burnout.&nbsp;</p>\n\n\n\n<p><strong>Do you have a 9 &#8211; 5 at the moment? If yes, how do you manage your 9 &#8211; 5 and still be able to give 100% to building these communities?&nbsp;</strong></p>\n\n\n\n<p>&nbsp;I am currently the community manager for the Google Developer Groups and the Women Techmakers program for Sub-Saharan Africa at Google, and managing my nine to five with every other thing that I do has not been easy. Still, I learned early enough, the importance of having a dedicated and supportive team. Whether they are fully or partly dedicated.&nbsp;</p>\n\n\n\n<p>Right now at She Code Africa and OSCA, we have core teams for each community. We have volunteers but there’s a point where you know you have to get full-time staff and we are rapidly getting to that point at She Code Africa. This is because our community has grown from zero to over 16k in almost 5 years. It is a community that is constantly growing and having a team was the first thing that I knew was important for me to efficiently handle my projects and prioritize.&nbsp;</p>\n\n\n\n<p>Another thing about me is that I am very disciplined, which I learned from my parents. Maybe I am also a perfectionist. Once I set my mind to something, I’d do everything to achieve it and make sure that the quality of the work that I put out there speaks for itself.&nbsp;</p>\n\n\n\n<p><strong>Amazing! What’s your favourite achievement so far in building She Code Africa?&nbsp;</strong></p>\n\n\n\n<p>&nbsp;My favourite achievement about building She Code Africa is the community itself. I mean, with the number of women we have in our community, it is almost like every day we see success stories. Our girls are joining Microsoft, Google and other top tech companies full-time. Women are now interested in tech, relocating to new countries and kicking off their careers in tech, thanks to what we do.</p>\n\n\n\n<p>When I started the community and said I wanted to get more women into tech, but it was quite difficult. You had to do a lot of convincing, but now these women are effortlessly joining the community. We get a minimum of about 100-200 women signing up to join the She Code Africa community daily. That&#8217;s growth. Seeing that we have provided the platform for these women to grow beyond their expectations. It is a huge thing to me.&nbsp;</p>\n\n\n\n<p>I love the brand that we have gotten to build. When people talk about needing recommendations for women in tech communities, SCA tops the list. We are gradually becoming one of the largest, if not the largest, community for women in tech in Africa. When people hear She Code Africa, they know it&#8217;s all about women in tech. We run programmes, share resources, help them build networks and give recommendations.</p>\n\n\n\n<p>Since we started running She Code Africa, we have never done any form of advertisement, it has always been referrals and word of mouth. Organisations reach out to us to partner cause they love what we do and can see&nbsp; our visible impact in the ecosystem. The feedback that we constantly get has been overwhelmingly positive. Before SCA, it was quite difficult for you to think of African communities for women in tech or non-profit organizations for women in tech within Africa.</p>\n\n\n\n<p>Globally there are lots of them, especially in America and in the UK, but when it comes to Africa, there aren’t many of them that are focused on training women and also providing the communities with a network. Different companies, companies within and outside Africa saying they want to associate with SCA makes me so proud as it is a brand that speaks for itself.&nbsp;</p>\n\n\n\n<p>I also feel like we are still just scratching the surface. We still have a lot of plans for the women within our community. We have programs focused on young Girls in Tech -girls from the ages of 8 to 18, Adult women in tech, moms in tech, oldies in tech &#8211; people who are above the ages of 50 and are interested in tech etc</p>\n\n\n\n<p>I am looking forward to that.&nbsp;</p>\n\n\n\n<p><strong>We’re rooting for you all the way! Finally, could you tell us a random non-work-related- fact about you?</strong>&nbsp;</p>\n\n\n\n<p>I love to dance when there&#8217;s good music. It doesn&#8217;t mean that I would do all of the legwork but I would move because music makes me happy. Music is a beautiful thing.</p>\n"},"posts":{"edges":[{"node":{"title":"Meet Olajumoke Oduwole: Founder of KJK Africa ","excerpt":"<p>She has been trained in entrepreneurship and business management in nine top-notch accelerator programs and enterprise development centres in Africa and Europe.</p>\n","slug":"women-in-tech-olajumoke-oduwole","date":"2024-05-08T07:58:40","categories":{"edges":[{"node":{"name":"Founders","slug":"founders"}}]},"featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/EDA185BF-30ED-418A-826C-07B542D1A034.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}}}},{"node":{"title":"Meet Damilola Odufuwa: Co-founder of Backdrop","excerpt":"<p>She is the co-founder of Backdrop, an Al-powered travel app and social network helping people easily find and share beautiful places.</p>\n","slug":"damilola-odufuwa-co-founder-backdrop","date":"2024-04-22T12:02:49","categories":{"edges":[{"node":{"name":"Founders","slug":"founders"}}]},"featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/04/WhatsApp-Image-2024-04-22-at-11.54.25_92ee63ac.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}}}},{"node":{"title":"Meet Tomilola Majekodunmi: CEO/Co-founder of Bankly","excerpt":"<p>Tomilola&#8217;s journey towards financial inclusion began with a collaboration on a product named SmartCredit.</p>\n","slug":"meet-tomilola-majekodunmi-ceo-co-founder-of-bankly","date":"2024-04-22T09:30:59","categories":{"edges":[{"node":{"name":"Founders","slug":"founders"}}]},"featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/04/WhatsApp-Image-2024-04-22-at-09.20.39_daa90ffa.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}}}},{"node":{"title":"Meet Yanmo Omorogbe: COO/Co-founder of Bamboo","excerpt":"<p>Yanmo aims to simplify investment and make it accessible to Africans, enabling them to grow their personal wealth.</p>\n","slug":"meet-yanmo-omorogbe-coo-co-founder-bamboo","date":"2024-04-16T19:42:14","categories":{"edges":[{"node":{"name":"Founders","slug":"founders"}}]},"featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/04/WhatsApp-Image-2024-04-16-at-19.35.53_f8328019.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}}}}]},"latest":{"edges":[{"node":{"title":"Startup Spotlight – Kola Market","excerpt":"<p>They help small and medium-sized businesses to drive sales all year round, increase their profits and grow sustainably.</p>\n","slug":"startup-spotlight-kola-market","date":"2024-05-08T08:05:38","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/274AC94E-2155-4C6E-9B08-EA8D4977C203.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Startups","slug":"startups","categoryId":5}}]},"tags":{"edges":[{"node":{"name":"Female-founder"}},{"node":{"name":"Founder"}},{"node":{"name":"Startup"}}]}}},{"node":{"title":"Meet Olajumoke Oduwole: Founder of KJK Africa ","excerpt":"<p>She has been trained in entrepreneurship and business management in nine top-notch accelerator programs and enterprise development centres in Africa and Europe.</p>\n","slug":"women-in-tech-olajumoke-oduwole","date":"2024-05-08T07:58:40","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/EDA185BF-30ED-418A-826C-07B542D1A034.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Founders","slug":"founders","categoryId":4}}]},"tags":{"edges":[{"node":{"name":"Female-founder"}},{"node":{"name":"Founder"}},{"node":{"name":"Startup"}}]}}},{"node":{"title":"Rose-Margaret Ekeng-Itua has become the first black woman to hold a PhD in Cybernetics","excerpt":"<p>An award-winning Nigerian Professor, Rose-Margaret Ekeng-Itua, has emerged as the first black woman in the world to earn a doctorate (PhD) in Cybernetics, which is the scientific study of control and communication in animals and machines, concerned with understanding complex systems like learning, cognition, adaptation, emergence, communication, and efficiency. Rose-Margaret is a pioneering educator, administrator, [&hellip;]</p>\n","slug":"rose-margaret-ekeng-itua-has-become-the-first-black-woman-to-hold-a-phd-in-cybernetics","date":"2024-05-07T18:05:21","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/IMG_1593.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"News","slug":"news","categoryId":8}}]},"tags":{"edges":[{"node":{"name":"Cybernetics"}},{"node":{"name":"News"}},{"node":{"name":"Tech"}}]}}},{"node":{"title":"Tech Sales vs Business Development","excerpt":"<p>Tech sales and Business development are important for generating revenue for companies in the tech industry. While both of them play the same role of contributing to the company’s growth, they do it in a different way and timeframe. Tech sales focus on closing deals with different customers, while business development creates new business opportunities [&hellip;]</p>\n","slug":"tech-sales-vs-business-development","date":"2024-05-07T14:56:20","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/joyful-successful-sales-agent-presenting-content-tablet-scaled.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Essays","slug":"essays","categoryId":1}}]},"tags":{"edges":[{"node":{"name":"Business Development"}},{"node":{"name":"Sales"}},{"node":{"name":"Tech"}}]}}},{"node":{"title":"The Stack Journal Launches Website for Women-Focused Tech News.","excerpt":"<p>According to Kiki Mordi, founder and CEO, The Stack Journal is forging partnerships with women in the tech industry.</p>\n","slug":"the-stack-journal-launches-website-for-women-focused-tech-news","date":"2024-05-02T09:56:59","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/96th-TSJ-7229.jpg"}},"author":{"node":{"name":"Kiki Mordi","firstName":"Kiki","lastName":"Mordi","avatar":{"url":"https://secure.gravatar.com/avatar/58f2fe88027e1ca7ef77f058feb3bde2?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"News","slug":"news","categoryId":8}}]},"tags":{"edges":[{"node":{"name":"Female-founder"}},{"node":{"name":"News"}},{"node":{"name":"Tech"}}]}}}]},"categories":{"edges":[{"node":{"name":"Awards","slug":"awards"}},{"node":{"name":"Dear Tech Sis","slug":"dear-tech-sis"}},{"node":{"name":"Essays","slug":"essays"}},{"node":{"name":"Events","slug":"events"}},{"node":{"name":"Founders","slug":"founders"}},{"node":{"name":"Industry Report","slug":"industry-report"}},{"node":{"name":"News","slug":"news"}},{"node":{"name":"Opportunities","slug":"opportunities"}},{"node":{"name":"Startups","slug":"startups"}},{"node":{"name":"uncategorized","slug":"uncategorized"}}]}},"__N_SSG":true}