{"pageProps":{"preview":false,"post":{"title":"Iko Africa’s Innovative Approach To Publishing For African Writers","excerpt":"<p>Iko Africa is one of such platforms that has been designed by Africans for Africans, in order to stand in that gap, and while it may not be one of the first of its kind in Africa or even Nigeria, it can still be considered a pioneering platform in this regard. </p>\n","slug":"iko-africas-innovative-approach-to-publishing-for-african-writers","date":"2023-10-06T12:00:00","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/03/xwm8ybqgsc47yvefwian.jpg"}},"author":{"node":{"name":"Sera","firstName":"Sera","lastName":null,"avatar":{"url":"https://secure.gravatar.com/avatar/2a462e903da67c292ea2bcc1d61a3c73?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Startups","slug":"startups","categoryId":5}}]},"tags":{"edges":[{"node":{"name":"African"}},{"node":{"name":"News"}},{"node":{"name":"Writers"}}]},"content":"\n<p>As the African digital space continues to grow, it has given Africans across industries the platform to take their work, businesses, and content onto the global stage.&nbsp; The African literary scene has benefited greatly from this growth, and as African writers continue to take up space globally, the mediums in which these stories are carried are just as important.&nbsp;</p>\n\n\n\n<p>Traditional publishing has gone a long way to put African writers on the map, however, its limitations have created a gap that I think digital publishing platforms have shown that they can fill.&nbsp; While traditional publishing has its merits, including the potential for broader distribution, access to established networks, and the prestige of being traditionally published by a publishing house, sometimes writers just want to publish short-form work without all the costs and procedures of traditional publishing.&nbsp;</p>\n\n\n\n<p>The flexibility in length and format that digital publishing platforms offer allows for a wide range of content formats, from short stories to essays, serialized novels, and long-form articles, the diversity is a major edge.</p>\n\n\n\n<p>Additionally, the rise of digital publishing has positioned writers in much easier proximity when it comes to accessibility and reach, allowing writers to reach readers worldwide without the need for traditional publishing channels.&nbsp;</p>\n\n\n\n<p>Digital publishing has also gone a long way in democratizing the publishing process, writers can easily upload and publish their work on these platforms without the need for agents, publishing deals, or printing costs, it also allows for immediate publishing, increasing writer&#8217;s speed and proximity to the market as opposed to traditional publishing which can be a lengthy process while navigating production timelines.&nbsp;</p>\n\n\n\n<p>Writers also have full control over their work when it comes to digital publishing, rights, royalties, and most of all, creative decisions, they do not have to worry about publishing norms or market demands.&nbsp;</p>\n\n\n\n<p>Digital publishing also allows for niche audiences and built-in communities of readers who can provide immediate feedback and engagement, writers looking to refine their skills and build a fanbase would find this direct interaction invaluable. In the same vein, we have social publishing platforms, a form of digital publishing that takes up social media structure in sharing and consuming literary content on social digital publishing platforms.&nbsp;</p>\n\n\n\n<p>Specifically designed to cater to writers and readers, these platforms create a space where everyone can engage with and appreciate written works, without the bureaucracy of agents and bottled neck operations of publishing houses, while effectively fostering a community centered around literature in real time, that allows for direct feedback and collaboration, long story short, they are social media apps focused on literary publishing.&nbsp;</p>\n\n\n\n<p>The momentum that these platforms have built over the years have given especially up-and-coming writers the opportunity to put themselves out there and build their career.&nbsp; Many writers often use these platforms as a portfolio for traditional writing gigs, a litmus test of such. However, the African writing community continues to remain underserved as a lot of these platforms tend to be majorly centered on pushing Western content, leaving Africans still in the minority.</p>\n\n\n\n<p>Iko Africa is one of such platforms that has been designed by Africans for Africans, in order to stand in that gap, and while it may not be one of the first of its kind in Africa or even Nigeria, it can still be considered a pioneering platform in this regard.&nbsp;</p>\n\n\n\n<p>Up until its launch, Iko Africa operated a closed beta platform that was only introduced to a select group of waitlisted users, on 8th September, 2023, the company launched its website to the general public, boasting of users across key regions including Nigeria, USA, the United Kingdom, Ghana, South Africa, Mauritius, and Kenya.</p>\n\n\n\n<p>In the light of its launch, we spoke to co-founder Josephine Inika on what to expect and the future of Iko Africa.</p>\n\n\n\n<p><strong>Tell us About Iko</strong></p>\n\n\n\n<p>The standard explanation of Iko is that it’s a social publishing app made for African writers to reach a unique audience and monetize their work effectively. But I prefer to say Iko is where our stories connect us. Writers, readers, and brands can join Iko and find what they’re looking for, be it a listening audience, work that resonates, the solution to a problem, or an escape from daily life.</p>\n\n\n\n<p><strong>What has the journey been like so </strong><span style=\"font-size: 16.8px;\"><b>far?</b></span></p>\n\n\n\n<p>A lot of false starts, learning curves, trial and error, and back and forth. Honestly, the journey has just begun. Ask me again a year from now.</p>\n\n\n\n<p><strong>What’s a major goal that the product is set out to achieve ?</strong></p>\n\n\n\n<p>Visibility for stories and ideas of African writers and brands. Basically, if you have something to say and you want people to hear you out, come and say it on Iko.</p>\n\n\n\n<p><strong>In what way or ways do you see Iko revitalizing the literary spacem</strong></p>\n\n\n\n<p>Every 3 business days, there are conversations online and offline about the death of African literature, the erosion of reading culture, and the lack of funding for writers. These conversations are valid and offer a lot of valuable insight, and I see Iko contributing towards solving these problems in practical sustainable ways.&nbsp;</p>\n\n\n\n<p><strong>What sets Iko aside from similar products in that market?</strong></p>\n\n\n\n<p>This is such a good question, and it’s one my cofounders and I often discuss. What sets us apart? Iko is built in a way that amplifies unique perspectives, ideas, and stories that are often unnoticed or even ignored. We create a way for you to build a proper community as a writer and discover content you enjoy and relate to as a reader. From our algorithm to monetization, we want to keep things simple yet highly useful.</p>\n\n\n\n<p><strong>How many users have you got currently?&nbsp;</strong></p>\n\n\n\n<p>We launched on September 8, 2023, and so far, we have over 1300 users.</p>\n\n\n\n<p><strong>Can you explain how writers can monetize their work on Iko Africa? What options are available for them?</strong></p>\n\n\n\n<p>We have several monetization packages, but we&#8217;re still strategizing which ones are the best to offer. We are taking our time because anything involving payments and money, especially in today&#8217;s economy, shouldn&#8217;t be taken lightly.</p>\n\n\n\n<p><strong>How do you ensure that the content on Iko&nbsp;</strong><strong>Africa remains diverse and inclusive, representing a wide range of African voices and perspectives?</strong></p>\n\n\n\n<p>Everything from the major things like the backend building of Iko to the small things like our email language is targeted at Africans as an audience.&nbsp;</p>\n\n\n\n<p>We recognize the multifacetedness of African writers, readers, and even brands, and will consistently ensure it drives our activities. As our tagline says, our stories connect us. Multiple stories, not one.</p>\n\n\n\n<p><strong>Are there any plans to expand the platform&#8217;s features or services in the near future? Can you provide a glimpse of what users can expect?</strong></p>\n\n\n\n<p>We&#8217;re focused on getting off the ground for now, but we definitely have a product and features map that&#8217;s always being added to. There&#8217;s no shortage of ideas for features, trust me.</p>\n\n\n\n<p><strong>What kind of support or resources does Iko Africa provide to help writers improve their craft and succeed on the platform?</strong></p>\n\n\n\n<p>For now, we provide writing classes, Iko conversations where we interview writers and creatives, Iko Editorials where we share writing tips and advice, and my personal favorite Iko Selects where we share a roundup of stories/essays/poems/reviews the Iko team loved that month.</p>\n\n\n\n<p><strong>How do you handle issues like plagiarism or copyright infringement on the platform to protect writers and their work?</strong></p>\n\n\n\n<p>Any copyright complaint we receive is looked into by our editorial team and if found liable, we take down the publication and also terminate the infringer’s account. This is well covered in our Terms of Use and Service.</p>\n\n\n\n<p><strong>How does Iko Africa plan to address the challenge of balancing user-generated content with maintaining a high-quality standard for published works?</strong></p>\n\n\n\n<p>Quality can be subjective. A story I like, another person may hate. An essay I find boring may be the best thing someone else has ever read. The question of quality and high standards is a constant in the writing and reading community.</p>\n\n\n\n<p>So honestly? Our work as the Iko team is to ensure our users adhere to our community guidelines and that we keep Iko Africa as safe as possible.</p>\n\n\n\n<p><strong>What plans does the team have for growth and user retention?</strong></p>\n\n\n\n<p>I can’t give away our plans. My cofounders would send me strongly worded emails, and the marketing and product team would roast me to hell and back on Slack.&nbsp;</p>\n\n\n\n<p><strong>What’s something or a few things you’ve come to realize as a founder?</strong></p>\n\n\n\n<p>Take the work seriously, but don’t take yourself too seriously. Sometimes, delusion is necessary to shoot certain shots or take certain risks. Rejection will come ten times over, so find an outlet for dealing with its negative effects so you don’t internalise it and blow up one day and cause irreparable damage.</p>\n\n\n\n<p>Celebrate every single win, big, medium, or small. A solid support system is a must; you need people even more than you need sleep. Lastly, don’t build a startup if you value your peace of mind.</p>\n\n\n\n<p><strong>Tell us a bit about your launch day?</strong></p>\n\n\n\n<p>That day went from 0 to negative 100 so fast. We planned to launch at a certain time in the evening. Some minutes after launch time, I got a message from engineering that deploying the app had failed.</p>\n\n\n\n<p>So now I was running between keeping social media updated, managing the whole team, and liaising with engineering to find out what happened. Eventually, 2 hours later, we fixed it and Iko launched to the public. I just want to say a big well done to the Iko team for pulling through. They’re my rockstars.</p>\n\n\n\n<p><strong>What has been your favorite and your least favorite thing about creating this product?</strong></p>\n\n\n\n<p>Favorite thing? I’m a writer, and I love stories/reading in general, so creating Iko makes me feel like a child building their dream toy and an adult putting together their dream house all at once.</p>\n\n\n\n<p>Least favorite thing? The paperwork and documentation and applications and follow-ups. It’s a lot! My goodness, there’s so much to keep track of!</p>\n"},"posts":{"edges":[]},"latest":{"edges":[{"node":{"title":"Startup Spotlight – Kola Market","excerpt":"<p>They help small and medium-sized businesses to drive sales all year round, increase their profits and grow sustainably.</p>\n","slug":"startup-spotlight-kola-market","date":"2024-05-08T08:05:38","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/274AC94E-2155-4C6E-9B08-EA8D4977C203.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Startups","slug":"startups","categoryId":5}}]},"tags":{"edges":[{"node":{"name":"Female-founder"}},{"node":{"name":"Founder"}},{"node":{"name":"Startup"}}]}}},{"node":{"title":"Meet Olajumoke Oduwole: Founder of KJK Africa ","excerpt":"<p>She has been trained in entrepreneurship and business management in nine top-notch accelerator programs and enterprise development centres in Africa and Europe.</p>\n","slug":"women-in-tech-olajumoke-oduwole","date":"2024-05-08T07:58:40","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/EDA185BF-30ED-418A-826C-07B542D1A034.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Founders","slug":"founders","categoryId":4}}]},"tags":{"edges":[{"node":{"name":"Female-founder"}},{"node":{"name":"Founder"}},{"node":{"name":"Startup"}}]}}},{"node":{"title":"Rose-Margaret Ekeng-Itua has become the first black woman to hold a PhD in Cybernetics","excerpt":"<p>An award-winning Nigerian Professor, Rose-Margaret Ekeng-Itua, has emerged as the first black woman in the world to earn a doctorate (PhD) in Cybernetics, which is the scientific study of control and communication in animals and machines, concerned with understanding complex systems like learning, cognition, adaptation, emergence, communication, and efficiency. Rose-Margaret is a pioneering educator, administrator, [&hellip;]</p>\n","slug":"rose-margaret-ekeng-itua-has-become-the-first-black-woman-to-hold-a-phd-in-cybernetics","date":"2024-05-07T18:05:21","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/IMG_1593.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"News","slug":"news","categoryId":8}}]},"tags":{"edges":[{"node":{"name":"Cybernetics"}},{"node":{"name":"News"}},{"node":{"name":"Tech"}}]}}},{"node":{"title":"Tech Sales vs Business Development","excerpt":"<p>Tech sales and Business development are important for generating revenue for companies in the tech industry. While both of them play the same role of contributing to the company’s growth, they do it in a different way and timeframe. Tech sales focus on closing deals with different customers, while business development creates new business opportunities [&hellip;]</p>\n","slug":"tech-sales-vs-business-development","date":"2024-05-07T14:56:20","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/joyful-successful-sales-agent-presenting-content-tablet-scaled.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Essays","slug":"essays","categoryId":1}}]},"tags":{"edges":[{"node":{"name":"Business Development"}},{"node":{"name":"Sales"}},{"node":{"name":"Tech"}}]}}},{"node":{"title":"The Stack Journal Launches Website for Women-Focused Tech News.","excerpt":"<p>According to Kiki Mordi, founder and CEO, The Stack Journal is forging partnerships with women in the tech industry.</p>\n","slug":"the-stack-journal-launches-website-for-women-focused-tech-news","date":"2024-05-02T09:56:59","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/96th-TSJ-7229.jpg"}},"author":{"node":{"name":"Kiki Mordi","firstName":"Kiki","lastName":"Mordi","avatar":{"url":"https://secure.gravatar.com/avatar/58f2fe88027e1ca7ef77f058feb3bde2?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"News","slug":"news","categoryId":8}}]},"tags":{"edges":[{"node":{"name":"Female-founder"}},{"node":{"name":"News"}},{"node":{"name":"Tech"}}]}}}]},"categories":{"edges":[{"node":{"name":"Awards","slug":"awards"}},{"node":{"name":"Dear Tech Sis","slug":"dear-tech-sis"}},{"node":{"name":"Essays","slug":"essays"}},{"node":{"name":"Events","slug":"events"}},{"node":{"name":"Founders","slug":"founders"}},{"node":{"name":"Industry Report","slug":"industry-report"}},{"node":{"name":"News","slug":"news"}},{"node":{"name":"Opportunities","slug":"opportunities"}},{"node":{"name":"Startups","slug":"startups"}},{"node":{"name":"uncategorized","slug":"uncategorized"}}]}},"__N_SSG":true}