{"pageProps":{"preview":false,"post":{"title":"Literature Meets Tech On Ifeoma Igwe’s Text-To-Speech App","excerpt":"<p>She is also a technology enthusiast and the creator of a text-to-speech app with a Nigerian accent which she uses to listen to her manuscript. </p>\n","slug":"literature-meets-tech-on-ifeoma-igwes-text-to-speech-app","date":"2023-03-04T12:00:00","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/03/srprqd42rwiioops8bhk.jpg"}},"author":{"node":{"name":"Atinuke","firstName":null,"lastName":"Atinuke","avatar":{"url":"https://secure.gravatar.com/avatar/2bd06a084e8eea9d9a5ba5be4402adc6?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Dear Tech Sis","slug":"dear-tech-sis","categoryId":3}}]},"tags":{"edges":[{"node":{"name":"Tech"}}]},"content":"\n<p>Our working woman this week is Ifeoma Igwe, an innovator and aspiring author. Ifeoma Igwe has just graduated with a master&#8217;s degree in digital innovation management from Loughborough University, London.&nbsp;</p>\n\n\n\n<p>Her short story, &#8220;<em>Assembly</em>&#8220;, was published in local Nigerian magazine&nbsp;<em>Agbowo</em>. In 2021, she was among the top 10 finalists for the fourth annual Beeta Playwright competition. She is also a technology enthusiast and the creator of a text-to-speech app with a Nigerian accent which she uses to listen to her manuscript. In her work, she combines her love for African literature with the technology necessary for its advancement.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What was your play about for the fourth annual Beeta Playwright competition?</strong></h2>\n\n\n\n<p>[My play was about&#8230;] men’s mental health and how it’s so bad because, culturally, they are not encouraged to express hurt healthily. My main character, Wale, has experienced loss after loss and feels like he can’t even talk to his friends about it. There’s a scene where he tries to attempt suicide in his ramshackle flat in Ajegunle that his friends don’t know about—which he’s had to move to since losing his apartment where he lived with his wife. This doesn’t succeed because there’s nowhere to attach the other end of the rope to, so he finally cries. After that, he finally opens up to his friends, who are willing to support him.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>I saw your app and loved it. Please tell me more about what inspired you to make it.</strong></h2>\n\n\n\n<p>It all started with a Twitter bot (@ifeomabot) that I created as a way to show off my python coding skills. It was programmed to tweet one book recommendation every six hours automatically. I read a lot of African fiction because that&#8217;s what I&#8217;m interested in, so the bot tweets books by African authors. So how it works is the script pulls from a file where I have my list of books.</p>\n\n\n\n<p>When I created this list, I realised it was from many different sources because there wasn’t one database dedicated to literary work by African authors large enough for me to copy and paste from. But I found this easily for non-African fiction, by the way.</p>\n\n\n\n<p>This meant I was scouring many blogs with titles like “50 African books to read in 2022”. I also found searching for “African books” on Amazon was redundant because it showed useless results. Anyway, that was when I decided to create my own database.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>How was the process? Break it down for us, please.&nbsp;</strong></h2>\n\n\n\n<p>My original plan was to add 100 new books to the list every month because it was exhausting to find this data in the first place. However, one day in October last year, I felt a surge of energy and added about 400 books in one go. It was easy to accomplish because the list only consisted of the book title and the author&#8217;s name, which is what the bot tweets.</p>\n\n\n\n<p>Besides, I had nothing better to do, and when my mind is fixed on something, I put a lot of effort into it. And so because the bot was tweeting about three times a day, it would take three months for the list to be exhausted, meaning I didn’t have to do any work for a while— work smart, not hard! But because of how restless I am, I was already thinking of what more I could do with this thing, you know.</p>\n\n\n\n<p>Eventually, I decided to make it a publicly available database, even without knowing how. So I created a different spreadsheet where I added more information like the book publication year, genre, author country and link to shop it on Amazon. After that, I began researching how to turn a spreadsheet into an app.</p>\n\n\n\n<p>I’m not nearly technical enough to create a python app from scratch, so I was grateful to discover no-code ways to do it, and glide was the only one I saw with a free plan, so I went with it. All I did was upload the spreadsheet to the workspace with a few minor designs here and there, and that was it, really.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What was your favourite part of the process?</strong></h2>\n\n\n\n<p>My favourite part of the process was discovering the different African authors from other countries. I hadn’t heard about them before, but many of their books are on my reading list now. I also discovered that Leye Adenle published a third addition to his easy-motion tourist series. So, I bought it immediately, which is what I’m currently reading.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Did you face any challenges? How did you overcome them, or how are you overcoming them?</strong></h2>\n\n\n\n<p>One of the challenges I faced was cleaning the spreadsheet of duplicates and wrong data entries. My current challenge with the glide app is my spreadsheet is now up to 700 books. However, with the free plan I’m on, the limit I can have is 500.</p>\n\n\n\n<p>So I’m trying to decide whether to close my eyes and invest in someone creating an app for me where there will be no limit and more functionality or upgrade my plan to a paid one that increases my limit to 5,000. The issue with the latter is that it’s a subscription and doesn’t even come with much-added functionality. It’s been a tough decision, and I’m still deciding.</p>\n\n\n\n<p><strong>How does your love for literature combine with your passion for technology?</strong></p>\n\n\n\n<p>My love for literature inspires the technology I’m interested in and the tools I enjoy building. For example, three years ago, I wrote a 70,000-word manuscript that I absolutely despise editing because of how monotonous rereading your work is, especially when it’s that long.</p>\n\n\n\n<p>So this year, again, to show off my coding skills, I built a text-to-speech web application where I can upload chunks of my manuscript to the app and have it read to me in its robot voice. But I went further and added a Nigerian accent to it, which I thought was pretty cool. The Nigerian accent can pronounce my characters&#8217; names and places in the book better than the default American accent. It’s been really exciting combining two things I love in this way.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Can you tell us more about the Nigerian accent feature for the text-to-speech app?</strong></h2>\n\n\n\n<p>It’s just an extra line of code to add what is known as a localised accent. All I had to do was find the top-level domain for Nigeria and include it in the python script.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Do you think technology is needed for the advancement of literature on the continent, and how?</strong></h2>\n\n\n\n<p>Definitely! Recently I read an article about Kọ́lá Túbọ̀sún’s work on translation technology, and he mentions how for a long time, Yoruba, which is a tone language, was forced into the limited frame of the Latin script. In Yoruba, two words spelt exactly the same could mean different things based on those intonations.</p>\n\n\n\n<p>So if the technology did not exist to include these tones, a Yoruba author would be hindered in typing in their language and would not be able to communicate effectively unless in English and why should they have to?</p>\n\n\n\n<p>There’s also the fact that Alexa, amazon’s voice assistant, can read an audiobook. But Alexa and other voice assistants like Siri don’t yet exist in local African languages, so they can’t read literature that isn’t in English. So that’s another opportunity that could advance literature in the continent.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What next for you?</strong></h2>\n\n\n\n<p>I&#8217;m trying to get my manuscript published. It would be nice to also have my book included in the database.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What story is in the manuscript you’re trying to publish?</strong></h2>\n\n\n\n<p>It’s about a girl who recently finished uni in London and unwillingly moved back home to Nigeria to try and figure out her life. Her journey to adulthood is different from her friends who have also just graduated, and it’s really about her fighting for her dreams even before she fully realizes what they are.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What are your favourite and least favourite parts of the work you do?</strong></h2>\n\n\n\n<p>So far, my favourite thing about the work has been learning how to build an app with no code. My least favourite thing is the hours I spend populating the spreadsheet and ensuring correct entries. I’m currently thinking of how I could potentially automate that.</p>\n"},"posts":{"edges":[{"node":{"title":"What Does it Mean to Be a Customer Support Manager? Insights from Chimuanya Dike","excerpt":"<p>Customer support plays an important role in the tech industry, especially in tech companies. It is responsible for helping customers with questions, concerns, and issues related to the company&#8217;s products or services. Customer support professionals speak with their customers via phone, email, chat support, etc. In our tech world today, customer support is often integrated [&hellip;]</p>\n","slug":"what-does-it-mean-to-be-a-customer-support-manager-insights-from-chimuanya-dike","date":"2024-05-02T09:54:28","categories":{"edges":[{"node":{"name":"Dear Tech Sis","slug":"dear-tech-sis"}}]},"featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/CHIMUANYA_DIKE-scaled.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}}}},{"node":{"title":"Careers in Tech for Women to Pursue","excerpt":"<p> With access to free online courses, scholarships, and various learning resources, you can learn any tech skill of your choice. </p>\n","slug":"careers-in-tech-for-women-to-pursue","date":"2024-04-16T13:28:52","categories":{"edges":[{"node":{"name":"Dear Tech Sis","slug":"dear-tech-sis"}}]},"featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/04/magnet-me-JUpaXbh-Fgc-unsplash-scaled.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}}}},{"node":{"title":"5 Influential Women Making Waves in the Tech Industry","excerpt":"<p>Female talent from all across Africa, including Ghana, Kenya, Nigeria, and South Africa, are reshaping the technology narrative.</p>\n","slug":"5-influential-women-making-waves-in-the-tech-industry","date":"2024-04-02T12:00:00","categories":{"edges":[{"node":{"name":"Dear Tech Sis","slug":"dear-tech-sis"}}]},"featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/03/two-business-woman-cafe-scaled.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}}}},{"node":{"title":"Career Change; Transitioning From Law To Tech","excerpt":"<p>If you’re a woman in tech and would love to share a story, opinion piece, or anything at all with us, shoot us an email at thestackjournal@gmail.com! We’d love to hear from you. </p>\n","slug":"career-change-transitioning-from-law-to-tech","date":"2024-03-19T12:23:13","categories":{"edges":[{"node":{"name":"Dear Tech Sis","slug":"dear-tech-sis"}}]},"featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/03/pzenelq7yyrhhqsuwyjm.jpg"}},"author":{"node":{"name":"Oluwatobi Afolabi","firstName":"Oluwatobi","lastName":"Afolabi","avatar":{"url":"https://secure.gravatar.com/avatar/8a46aaa3e1f6249d3aac48b14f576580?s=96&d=mm&r=g"}}}}}]},"latest":{"edges":[{"node":{"title":"Startup Spotlight – Kola Market","excerpt":"<p>They help small and medium-sized businesses to drive sales all year round, increase their profits and grow sustainably.</p>\n","slug":"startup-spotlight-kola-market","date":"2024-05-08T08:05:38","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/274AC94E-2155-4C6E-9B08-EA8D4977C203.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Startups","slug":"startups","categoryId":5}}]},"tags":{"edges":[{"node":{"name":"Female-founder"}},{"node":{"name":"Founder"}},{"node":{"name":"Startup"}}]}}},{"node":{"title":"Meet Olajumoke Oduwole: Founder of KJK Africa ","excerpt":"<p>She has been trained in entrepreneurship and business management in nine top-notch accelerator programs and enterprise development centres in Africa and Europe.</p>\n","slug":"women-in-tech-olajumoke-oduwole","date":"2024-05-08T07:58:40","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/EDA185BF-30ED-418A-826C-07B542D1A034.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Founders","slug":"founders","categoryId":4}}]},"tags":{"edges":[{"node":{"name":"Female-founder"}},{"node":{"name":"Founder"}},{"node":{"name":"Startup"}}]}}},{"node":{"title":"Rose-Margaret Ekeng-Itua has become the first black woman to hold a PhD in Cybernetics","excerpt":"<p>An award-winning Nigerian Professor, Rose-Margaret Ekeng-Itua, has emerged as the first black woman in the world to earn a doctorate (PhD) in Cybernetics, which is the scientific study of control and communication in animals and machines, concerned with understanding complex systems like learning, cognition, adaptation, emergence, communication, and efficiency. Rose-Margaret is a pioneering educator, administrator, [&hellip;]</p>\n","slug":"rose-margaret-ekeng-itua-has-become-the-first-black-woman-to-hold-a-phd-in-cybernetics","date":"2024-05-07T18:05:21","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/IMG_1593.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"News","slug":"news","categoryId":8}}]},"tags":{"edges":[{"node":{"name":"Cybernetics"}},{"node":{"name":"News"}},{"node":{"name":"Tech"}}]}}},{"node":{"title":"Tech Sales vs Business Development","excerpt":"<p>Tech sales and Business development are important for generating revenue for companies in the tech industry. While both of them play the same role of contributing to the company’s growth, they do it in a different way and timeframe. Tech sales focus on closing deals with different customers, while business development creates new business opportunities [&hellip;]</p>\n","slug":"tech-sales-vs-business-development","date":"2024-05-07T14:56:20","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/joyful-successful-sales-agent-presenting-content-tablet-scaled.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Essays","slug":"essays","categoryId":1}}]},"tags":{"edges":[{"node":{"name":"Business Development"}},{"node":{"name":"Sales"}},{"node":{"name":"Tech"}}]}}},{"node":{"title":"The Stack Journal Launches Website for Women-Focused Tech News.","excerpt":"<p>According to Kiki Mordi, founder and CEO, The Stack Journal is forging partnerships with women in the tech industry.</p>\n","slug":"the-stack-journal-launches-website-for-women-focused-tech-news","date":"2024-05-02T09:56:59","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/96th-TSJ-7229.jpg"}},"author":{"node":{"name":"Kiki Mordi","firstName":"Kiki","lastName":"Mordi","avatar":{"url":"https://secure.gravatar.com/avatar/58f2fe88027e1ca7ef77f058feb3bde2?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"News","slug":"news","categoryId":8}}]},"tags":{"edges":[{"node":{"name":"Female-founder"}},{"node":{"name":"News"}},{"node":{"name":"Tech"}}]}}}]},"categories":{"edges":[{"node":{"name":"Awards","slug":"awards"}},{"node":{"name":"Dear Tech Sis","slug":"dear-tech-sis"}},{"node":{"name":"Essays","slug":"essays"}},{"node":{"name":"Events","slug":"events"}},{"node":{"name":"Founders","slug":"founders"}},{"node":{"name":"Industry Report","slug":"industry-report"}},{"node":{"name":"News","slug":"news"}},{"node":{"name":"Opportunities","slug":"opportunities"}},{"node":{"name":"Startups","slug":"startups"}},{"node":{"name":"uncategorized","slug":"uncategorized"}}]}},"__N_SSG":true}