{"pageProps":{"preview":false,"post":{"title":"Nigeria’s Fintech Scene And The Women Who Lead It","excerpt":"<p>There has been an increase in the number of new venture funds and female-led angel investors willing to support women with African businesses. </p>\n","slug":"nigerias-fintech-scene-and-the-women-who-lead-it","date":"2022-09-17T12:00:00","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/03/zg4dzc5sa6m3it1bnslp.jpg"}},"author":{"node":{"name":"Iyanuoluwa Adenle","firstName":"Iyanuoluwa","lastName":"Adenle","avatar":{"url":"https://secure.gravatar.com/avatar/aeeddafd589107b66a58882d645c7bd5?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Industry Report","slug":"industry-report","categoryId":10}}]},"tags":{"edges":[{"node":{"name":"Tech"}}]},"content":"\n<p>The tech ecosystem has been on fire this year. This year alone, more women in the Nigeria tech space have been recognised for their innovation, growth, and success. At least, <a href=\"https://www.linkedin.com/pulse/theres-never-been-better-time-invest-africas-female-founders-norman?utm_source=share&amp;utm_medium=member_ios&amp;utm_campaign=share_via\">35 </a>female-founded startups like Gander, Babymigo, Foondamate, Healthtracka, and others have <a href=\"https://thestackjournal.substack.com/p/do-the-maths-bridging-the-gender\">raised money by closing pre-seed and seed rounds</a> in the last 2- quarters. There has been an increase in the number of new venture funds and female-led angel investors willing to support women with African businesses. </p>\n\n\n\n<p>Although we cannot overlook the existing gender disparities within the tech space, these women have made commendable contributions that should be celebrated in the ecosystem. The women on this list have successfully raised capital for their startups; expanded their businesses; selected and featured on lists like 2022 Google Black Founders Fund, Bloomberg New Economy Catalysts 2022; accepted into reputable accelerators such as Techstars Toronto Accelerator (Techstars Toronto) and Y Combinator (YC) this year alone. We would like to recognise some of the Nigerian women in the fintech space making great strides. </p>\n\n\n\n<p>There is an endless list of women making a difference in the fintech industry in Nigeria, but for the sake of this article, we will highlight the 10 Nigerian women taking charge in the Nigerian Fintech space.&nbsp;</p>\n\n\n\n<p><strong>Odunayo Eweniyi</strong></p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https://res.cloudinary.com/documentwomen/image/upload/q_auto/f_auto/gpgvmeviykbc6tcnrjia?_a=AACnOBs\" alt=\"img_7872\"/></figure>\n\n\n\n<p>Odunayo Eweniyi is the Co-founder and Chief Operating Officer of PiggyTech Global Ltd, a digital savings platform that is committed to helping people effectively manage their finances by saving money towards their targets/goals with higher returns. Through automated micro-savings, the fintech is focused on making finances more straightforward and more transparent for low- and middle-income earners while also encouraging economic growth in Africa. With over 4 million users and $200 million in assets under management, the platform provides competitive savings interest rates and encourages discipline through a limited number of free withdrawals. She also co-founded&nbsp;<a href=\"https://documentwomen.com/first-check-providing-funding-for-african-female-founders\">FirstCheck Africa</a>, a female-focused angel fund dedicated to providing access to capital for female founders from diverse sectors across Africa. Odunayo Eweniyi is very passionate about empowering girls and women to pursue advanced interests and roles in the tech space.&nbsp;</p>\n\n\n\n<p><strong>Fara Ashiru Jituboh</strong></p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https://res.cloudinary.com/documentwomen/image/upload/q_auto/f_auto/viaxraqnlbd08d2kxdnv?_a=AACnOBs\" alt=\"img_7876\"/></figure>\n\n\n\n<p>Fara Ashiru Jituboh is a software engineer and entrepreneur. She is the co-founder and CEO/CTO of Okra, a Nigerian-based startup that enables the secure exchange of real-time financial information between customers, applications, and banks. The company provides an application programming interface (API) that allows users to connect their bank accounts with verified financial information to third-party applications.</p>\n\n\n\n<p><strong>Damisi Busari</strong></p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https://res.cloudinary.com/documentwomen/image/upload/q_auto/f_auto/tsfppqz9dso1loxds3wp?_a=AACnOBs\" alt=\"IMG_20220917_130320\"/></figure>\n\n\n\n<p>Damisi Busari is the founder and CEO SendSprint Technology Solutions, an innovative payments company targeting the African diaspora. In partnership with Flutterwave, Sendsprint is in charge of facilitating smooth international transfers and unique gifting to 34 African countries. For Busari, the idea behind the startup is to maintain the connection between Africans in the diaspora with their loved ones.&nbsp;</p>\n\n\n\n<p><strong>Adia Sowho</strong></p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https://res.cloudinary.com/documentwomen/image/upload/q_auto/f_auto/gdg3dpf0onnjqaayirao?_a=AACnOBs\" alt=\"IMG_20220917_130556\"/></figure>\n\n\n\n<p>Adia Sowho is the CEO of Thrive Agric, an agriculture fintech company, and a non-executive director of Hover Developer Services. She has established a reputation as a problem solver in Nigeria&#8217;s commercial, technology, and media sectors. With a background in mobile content development, technology, and financial services, she is now focused on improving Nigeria&#8217;s digital culture and inspiring more young women to enter the business.</p>\n\n\n\n<p><strong>Eloho Omame</strong></p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https://res.cloudinary.com/documentwomen/image/upload/q_auto/f_auto/cxbgvyv6mu8l7fsw60g5?_a=AACnOBs\" alt=\"img_7877\"/></figure>\n\n\n\n<p>Eloho Omame is the co-founder and co-managing partner of FirstCheck Africa, a female-focused angel fund committed to providing access to capital for female founders across Africa. She graduated from the London School of Economics with an MBA from London Business School. Before launching FirstCheck Africa with Odunayo Eweniyi, she started Endeavor, an entrepreneur support organisation.&nbsp;<a href=\"https://thestackjournal.substack.com/p/when-a-woman-in-tech-wins-we-all?utm_source=profile&amp;utm_medium=reader2\">She recently joined TLcom Capital, a new African venture capital firm, as a Partner</a>. Eloho Omame has always been invested in the business of getting more female founders the representation that they need in the tech startup and VC scene.&nbsp;</p>\n\n\n\n<p><strong>Khadijah Abu</strong></p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https://res.cloudinary.com/documentwomen/image/upload/q_auto/f_auto/ppojg4ejlqs7e9cg5huj?_a=AACnOBs\" alt=\"img_7883\"/></figure>\n\n\n\n<p>Khadijah Abu is the Product Partnerships Lead at Paystack Payments Limited, a fintech startup that enables businesses across Africa to accept payments from their customers. With over ten years of experience in the Nigerian Fintech and Payments space working in Operations, Business Process Re-engineering and Product Management, Khadijah has managed products worth billions of dollars in revenue while supervising the design and implementation of significant business automation projects. She is interested in supporting education and community development while helping businesses grow in the tech space.&nbsp;</p>\n\n\n\n<p><strong>Oluwaseun Runsewe</strong></p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https://res.cloudinary.com/documentwomen/image/upload/q_auto/f_auto/u6t1bpituy7rupui9kvu?_a=AACnOBs\" alt=\"img_7879\"/></figure>\n\n\n\n<p>’Seun Runsewe is the Senior Product Manager at Chipper Cash, an African cross-border payments company, and the Vice President of Growth at Softcom Limited, a leading tech solutions company based in Nigeria. She began her career as an analyst before joining Paystack as a business lead. She is committed to making financial services accessible to everyone, especially single mothers such as herself.</p>\n\n\n\n<p>She created and beta-tested Switch by Sterling Bank, a multi-currency digital bank, making her Africa&#8217;s youngest banking CEO.</p>\n\n\n\n<p><strong>Yanmo Omorogbe</strong></p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https://res.cloudinary.com/documentwomen/image/upload/q_auto/f_auto/lgmnb7pioxwinbzlyurz?_a=AACnOBs\" alt=\"IMG_20220917_132432\"/></figure>\n\n\n\n<p>Yanmo Omorogbe is the co-founder and COO of Bamboo. This digital investment platform gives Nigerians real-time access to buy, sell or hold assets traded on the US stock exchange from their mobile phones or computers. Yanmo leads growth and operations as the COO of Bamboo. To Omorogbe, the goal is to encourage and enable investing across Africa, making it simple and easy for Africans in the diaspora to invest back home. Omorogbe is the operational backbone of a business turning ordinary Nigerians into global investors. With Bamboo, the average Nigerian can become a shareholder in the technology companies they use daily, like Twitter, Google, Apple, Amazon, Microsoft and Facebook.&nbsp;</p>\n\n\n\n<p><strong>Damilola Odufuwa</strong></p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https://res.cloudinary.com/documentwomen/image/upload/q_auto/f_auto/m6x3fyjliw7tv2kzfdsg?_a=AACnOBs\" alt=\"img_7881-1\"/></figure>\n\n\n\n<p>Damilola Odufuwa is a tech executive and women’s rights advocate. Currently, she is heading global product communications for Binance, the world’s largest cryptocurrency exchange and blockchain ecosystem. She is interested in work that intersects cryptocurrency, communications, and women’s rights. She has been listed as one of “Six Women At The Forefront Of West Africa’s Tech Boom” by Vogue and one of the “Rising Women In Crypto” by Fintech Times and Wirex.</p>\n\n\n\n<p><strong>Solape Akinpelu</strong></p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https://res.cloudinary.com/documentwomen/image/upload/q_auto/f_auto/resgcwjci2koejfflpg8?_a=AACnOBs\" alt=\"images (2)\"/></figure>\n\n\n\n<p>Solape Akinpelu is the founder and CEO of HerVest, an inclusive fintech platform for the disadvantaged and disenfranchised women in Africa. HerVest allows women to participate in lending, impact investments, and savings, especially for Nigerian smallholder women farmers. She is committed to advancing gender equality and reducing inequality through technology, access to capital, and financial literacy.</p>\n\n\n\n<p>These women represent a small percentage of the total number of women making badass moves in the Nigerian tech space. There are other women in the health-tech, agro-tech, edtech, and other fields like software developers, designers, content creators, market strategists, etc. Their work and achievements, while bridging the gender gap, wage gap and confidence gap, should inspire more girls and women to seek out rewarding opportunities in the tech industry actively.</p>\n"},"posts":{"edges":[{"node":{"title":"#IWD24: Only 33.7% Of Nigerian Women Find Tech Workplaces Truly Inclusive","excerpt":"<p>In line with the 2024 International Women&#8217;s Day theme, &#8220;Inspire Inclusion&#8221;, Document Women, The Stack Journal, and Maktaba collaborated on a survey to assess women&#8217;s experiences in the tech industry.</p>\n","slug":"iwd24-only-33-7-of-nigerian-women-find-tech-workplaces-truly-inclusive","date":"2024-03-08T12:00:00","categories":{"edges":[{"node":{"name":"Industry Report","slug":"industry-report"}}]},"featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/03/mn7fyq2frqcs7k2dsyu7.jpg"}},"author":{"node":{"name":"Vanessa Onyema","firstName":"Vanessa","lastName":"Onyema","avatar":{"url":"https://secure.gravatar.com/avatar/73fcc95d4b9a7e9607581a2890b00303?s=96&d=mm&r=g"}}}}}]},"latest":{"edges":[{"node":{"title":"Startup Spotlight – Kola Market","excerpt":"<p>They help small and medium-sized businesses to drive sales all year round, increase their profits and grow sustainably.</p>\n","slug":"startup-spotlight-kola-market","date":"2024-05-08T08:05:38","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/274AC94E-2155-4C6E-9B08-EA8D4977C203.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Startups","slug":"startups","categoryId":5}}]},"tags":{"edges":[{"node":{"name":"Female-founder"}},{"node":{"name":"Founder"}},{"node":{"name":"Startup"}}]}}},{"node":{"title":"Meet Olajumoke Oduwole: Founder of KJK Africa ","excerpt":"<p>She has been trained in entrepreneurship and business management in nine top-notch accelerator programs and enterprise development centres in Africa and Europe.</p>\n","slug":"women-in-tech-olajumoke-oduwole","date":"2024-05-08T07:58:40","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/EDA185BF-30ED-418A-826C-07B542D1A034.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Founders","slug":"founders","categoryId":4}}]},"tags":{"edges":[{"node":{"name":"Female-founder"}},{"node":{"name":"Founder"}},{"node":{"name":"Startup"}}]}}},{"node":{"title":"Rose-Margaret Ekeng-Itua has become the first black woman to hold a PhD in Cybernetics","excerpt":"<p>An award-winning Nigerian Professor, Rose-Margaret Ekeng-Itua, has emerged as the first black woman in the world to earn a doctorate (PhD) in Cybernetics, which is the scientific study of control and communication in animals and machines, concerned with understanding complex systems like learning, cognition, adaptation, emergence, communication, and efficiency. Rose-Margaret is a pioneering educator, administrator, [&hellip;]</p>\n","slug":"rose-margaret-ekeng-itua-has-become-the-first-black-woman-to-hold-a-phd-in-cybernetics","date":"2024-05-07T18:05:21","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/IMG_1593.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"News","slug":"news","categoryId":8}}]},"tags":{"edges":[{"node":{"name":"Cybernetics"}},{"node":{"name":"News"}},{"node":{"name":"Tech"}}]}}},{"node":{"title":"Tech Sales vs Business Development","excerpt":"<p>Tech sales and Business development are important for generating revenue for companies in the tech industry. While both of them play the same role of contributing to the company’s growth, they do it in a different way and timeframe. Tech sales focus on closing deals with different customers, while business development creates new business opportunities [&hellip;]</p>\n","slug":"tech-sales-vs-business-development","date":"2024-05-07T14:56:20","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/joyful-successful-sales-agent-presenting-content-tablet-scaled.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Essays","slug":"essays","categoryId":1}}]},"tags":{"edges":[{"node":{"name":"Business Development"}},{"node":{"name":"Sales"}},{"node":{"name":"Tech"}}]}}},{"node":{"title":"The Stack Journal Launches Website for Women-Focused Tech News.","excerpt":"<p>According to Kiki Mordi, founder and CEO, The Stack Journal is forging partnerships with women in the tech industry.</p>\n","slug":"the-stack-journal-launches-website-for-women-focused-tech-news","date":"2024-05-02T09:56:59","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/96th-TSJ-7229.jpg"}},"author":{"node":{"name":"Kiki Mordi","firstName":"Kiki","lastName":"Mordi","avatar":{"url":"https://secure.gravatar.com/avatar/58f2fe88027e1ca7ef77f058feb3bde2?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"News","slug":"news","categoryId":8}}]},"tags":{"edges":[{"node":{"name":"Female-founder"}},{"node":{"name":"News"}},{"node":{"name":"Tech"}}]}}}]},"categories":{"edges":[{"node":{"name":"Awards","slug":"awards"}},{"node":{"name":"Dear Tech Sis","slug":"dear-tech-sis"}},{"node":{"name":"Essays","slug":"essays"}},{"node":{"name":"Events","slug":"events"}},{"node":{"name":"Founders","slug":"founders"}},{"node":{"name":"Industry Report","slug":"industry-report"}},{"node":{"name":"News","slug":"news"}},{"node":{"name":"Opportunities","slug":"opportunities"}},{"node":{"name":"Startups","slug":"startups"}},{"node":{"name":"uncategorized","slug":"uncategorized"}}]}},"__N_SSG":true}