{"pageProps":{"preview":false,"post":{"title":"TechCabal’s Koromone Koroye On Bridging The Confidence Gap In The Tech Industry","excerpt":"<p>Koromone is a badass storyteller, who is reimagining new ways to tell stories with a clear social impact in the business and tech sectors. </p>\n","slug":"techcabals-koromone-koroye-on-bridging-the-confidence-gap-in-the-tech-industry","date":"2022-07-16T12:00:00","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/03/vgeuntvgbnhamyopm5om.jpg"}},"author":{"node":{"name":"Iyanuoluwa Adenle","firstName":"Iyanuoluwa","lastName":"Adenle","avatar":{"url":"https://secure.gravatar.com/avatar/aeeddafd589107b66a58882d645c7bd5?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Dear Tech Sis","slug":"dear-tech-sis","categoryId":3}}]},"tags":{"edges":[{"node":{"name":"Tech"}},{"node":{"name":"Writer"}}]},"content":"\n<p>Koromone Koroye is a powerhouse in TechCabal’s newsroom at Big Cabal Media, one of Africa’s leading voices in media. She is a badass storyteller, who is reimagining new ways to tell stories with a clear social impact in the business and tech sectors.&nbsp;</p>\n\n\n\n<p>In this interview, Koromone tells us about her role as a creative storyteller in the tech industry and shares what is necessary in bridging the confidence gap while highlighting her own experiences as a woman in the tech space.&nbsp;</p>\n\n\n\n<p><strong>Hi Koromone! Tell us about yourself. </strong></p>\n\n\n\n<p>Hello Stack Journal! My name is Koromone Koroye. I am a creative writer and thinker, a poet, public speaker and a great conversationalist as well. I am currently the Managing Editor and acting Editor-in-Chief of TechCabal at Big Cabal Media. I performed spoken word poetry for over eight years. I trained to be a spoken word performer and a communication specialist. I am a very ambitious, career-minded and goal-oriented woman. I think I&#8217;m a social person as well but I do prefer to be at home in my house, safely protected from the wildness and craziness of Lagos and Nigeria. I am also an ordained minister and that is connected to my life in every way.&nbsp;</p>\n\n\n\n<p><strong>Many hats and you wear them quite well. Tell us about being a storyteller and a poet. What was the trajectory to this particular career choice?</strong></p>\n\n\n\n<p>I wasn’t very strict about my career choice. I knew that I didn&#8217;t want to work in a conventional corporate setting or in a Nigerian bank which, for some reason, a lot of people recommended to me when I moved back to Nigeria. I just knew that I had a very unique skill. I knew that I was able to write, not just creatively, but in a way that communicates thoughts and ideas in a clearer way, or in a simplified way. So when I joined Flutterwave in 2016, which was the first company I worked with in the tech industry, I realised that I could use this unique storytelling skill to help businesses communicate with their consumers or clients. After I left Flutterwave in 2018, I just stayed on the path of business storytelling and it has obviously manifested in different ways from being a PR Associate to being a Communications Executive to being a Marketing person to being a Social Media Manager, and then ending up as TechCabal’s Managing Editor and now acting Editor-in-Chief.&nbsp;</p>\n\n\n\n<p>As a poet, it wasn’t a career choice. It was a gift that was given to me and I call myself a poet because that&#8217;s who I am. I studied Poetry at the university. That&#8217;s how much I was dedicated to developing that skill and that gift.&nbsp;</p>\n\n\n\n<p><strong>When and how did you decide on your niche as a storyteller in the tech industry?</strong>&nbsp;</p>\n\n\n\n<p>My first tech job was a launch pad for my career in storytelling for businesses. I&#8217;m actually glad that storytelling is a niche as well because it means that no matter what that specific skill set or that subset of the storytelling for the business sector can never be oversaturated, right? Because there will always be people like me who find creative ways to come into the industry and continue to build upon the foundations that have already been laid.</p>\n\n\n\n<p><strong>Do you still write non-tech stories? If so, how do you balance your work as a creative storyteller and as a tech journalist?</strong></p>\n\n\n\n<p>Yeah, I still do write non-tech stories. I have a <a href=\"https://koromone.medium.com/\">Medium blog</a> where I post occasionally when I get inspired. When my brain is able to take a break from all this editorial tech stuff, I will write something and post it on Medium. The way I find balance is by ensuring that once my workday is over, I immediately kind of turn my work brain off, and I turn on my creative brain. I journal. When I get random thoughts or random words for a poem, I try my best to write them down as quickly as possible before it escapes my brain. </p>\n\n\n\n<p><strong>Tell us about your processes as the managing editor at TechCabal?&nbsp;</strong></p>\n\n\n\n<p>Being the managing editor of TechCabal is a big job. My role is very operational. When I joined TechCabal in 2021, I was managing a team of five full-time reporters. Now, I manage a team of about ten people &#8211; a combination of reporters, editors, and junior writers -. It&#8217;s a very hands-on and contact-heavy role. I&#8217;m speaking to my team members constantly on a daily basis, planning one-on-one meetings. Then there&#8217;s my role as a leader in Big Cabal Media which requires me to also care about what&#8217;s going on in the business. It&#8217;s a multifaceted and multi-dimensional role, but it&#8217;s primarily operational. So If TechCabal was a business, as managing editor, I would be the COO.</p>\n\n\n\n<p><strong>Have you faced any challenges being a woman in tech, a tech journalist and as the managing editor of one of Africa’s leading voices in media?</strong></p>\n\n\n\n<p>Challenges? My goodness. Top on the list is not being taken seriously. Whenever I introduce myself as a journalist or that I work at TechCabal, people automatically assume that all I do is write. I will be, “No, I actually lead the newsroom. Thank you very much.” I also get people telling me,&nbsp;<em>“Oh, you&#8217;re so busy. You&#8217;re busy all the time. Do you have a life?”&nbsp;</em>I do have a life. After work? I shut down. I don&#8217;t play games with my rest or with my personal life.&nbsp;</p>\n\n\n\n<p><strong>People often talk about the gender gap and the wage gap in the tech industry and they miss the ‘confidence gap.’ The one where women in tech feel like they have to do double the work to fit in. How can we address and close the confidence gap in the tech industry through media?</strong></p>\n\n\n\n<p>There&#8217;s that general stereotype of a woman in tech who is either not doing enough or working too hard, right? There&#8217;s also the challenge of how difficult it is to be a woman trying to work in this industry. Even trying to enter it is so much more difficult now, and I&#8217;m grateful that I got in at the time that I did because I can&#8217;t imagine trying to enter the industry as a fresh bright-eyed woman trying to work in tech. It&#8217;s just so much harder now. The rules of engagement have changed and you now have to work three times as hard as a woman to be taken seriously or to even be considered, especially at a junior level. I&#8217;ve faced the same challenges that most women face, and I think that when we&#8217;re thinking about closing gender gaps, whether with money, salaries, or benefits, the only advice I can give is to women directly, and it&#8217;s that we need to speak up. We need to demand better. We need to be able to sit at the table and say,&nbsp;<em>“I&#8217;m not being paid well enough. I&#8217;m not being taken seriously as I should be. My male counterparts are being taken seriously more than I am being taken seriously and that needs to change.”</em>&nbsp;We have to remember that it&#8217;s our skills and our gifts that get us into these rooms. If you&#8217;re working for an organisation or a leader, who you feel is taking advantage of you, their access to you, and the fact that they&#8217;re paying you X amount every month and feeling like you&#8217;re supposed to be the nurturer, or that you&#8217;re not supposed to be too serious or too confident, you are doing yourself a disservice by staying there. Yes, organisations ultimately need to change their processes and it begins with someone speaking up. It begins with a group of women standing up and saying,&nbsp;<em>“you know, what, enough is enough.”</em>&nbsp;We need to be the ones to bring this change, or else organisations are going to stay stuck in the past.&nbsp;</p>\n\n\n\n<p><strong>I absolutely agree! What does a good news day look like for you?&nbsp;</strong></p>\n\n\n\n<p>A good news day for me is seeing stories that are not just about funding or raising X amount of capital. It&#8217;s about seeing stories that have a clear social impact, connecting with founders, and entrepreneurs who are willing to give a bit more than a boilerplate-like press release, or tell us the bare minimum, but they&#8217;re willing to really talk to us about their business model, what it is they&#8217;re doing and how it is that they&#8217;re changing Africa with technology and business. A good news day is getting access to a wide variety of stories and ideas that I can bring to the newsroom and assign to my reporters.&nbsp;</p>\n\n\n\n<p><strong>What content do you like to read, watch, or listen to?</strong></p>\n\n\n\n<p>When I&#8217;m working, I like to listen to electronic music or jazz. I have very specific playlists on Apple Music and YouTube music that help me focus. Apple has a lot of really good electronic playlists. It just works for me because my role is very cerebral and I don&#8217;t need music that&#8217;s going to distract me. Lately, I&#8217;ve been obsessed with <em>Honestly, Nevermind</em> by Drake. I listen to Lo-Fi chill on Apple Music. I also listen to <em>Harris&#8217; house</em>, sometimes, while I work. </p>\n\n\n\n<p>I&#8217;m reading this interesting book titled&nbsp;<em>Sarong Party Girls</em>&nbsp;by Cheryl Lu-Lien Tan. After work, I just watch reruns of&nbsp;<em>Friends</em>&nbsp;or&nbsp;<em>The Office</em>.&nbsp;</p>\n"},"posts":{"edges":[{"node":{"title":"What Does it Mean to Be a Customer Support Manager? Insights from Chimuanya Dike","excerpt":"<p>Customer support plays an important role in the tech industry, especially in tech companies. It is responsible for helping customers with questions, concerns, and issues related to the company&#8217;s products or services. Customer support professionals speak with their customers via phone, email, chat support, etc. In our tech world today, customer support is often integrated [&hellip;]</p>\n","slug":"what-does-it-mean-to-be-a-customer-support-manager-insights-from-chimuanya-dike","date":"2024-05-02T09:54:28","categories":{"edges":[{"node":{"name":"Dear Tech Sis","slug":"dear-tech-sis"}}]},"featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/CHIMUANYA_DIKE-scaled.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}}}},{"node":{"title":"Careers in Tech for Women to Pursue","excerpt":"<p> With access to free online courses, scholarships, and various learning resources, you can learn any tech skill of your choice. </p>\n","slug":"careers-in-tech-for-women-to-pursue","date":"2024-04-16T13:28:52","categories":{"edges":[{"node":{"name":"Dear Tech Sis","slug":"dear-tech-sis"}}]},"featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/04/magnet-me-JUpaXbh-Fgc-unsplash-scaled.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}}}},{"node":{"title":"5 Influential Women Making Waves in the Tech Industry","excerpt":"<p>Female talent from all across Africa, including Ghana, Kenya, Nigeria, and South Africa, are reshaping the technology narrative.</p>\n","slug":"5-influential-women-making-waves-in-the-tech-industry","date":"2024-04-02T12:00:00","categories":{"edges":[{"node":{"name":"Dear Tech Sis","slug":"dear-tech-sis"}}]},"featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/03/two-business-woman-cafe-scaled.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}}}},{"node":{"title":"Career Change; Transitioning From Law To Tech","excerpt":"<p>If you’re a woman in tech and would love to share a story, opinion piece, or anything at all with us, shoot us an email at thestackjournal@gmail.com! We’d love to hear from you. </p>\n","slug":"career-change-transitioning-from-law-to-tech","date":"2024-03-19T12:23:13","categories":{"edges":[{"node":{"name":"Dear Tech Sis","slug":"dear-tech-sis"}}]},"featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/03/pzenelq7yyrhhqsuwyjm.jpg"}},"author":{"node":{"name":"Oluwatobi Afolabi","firstName":"Oluwatobi","lastName":"Afolabi","avatar":{"url":"https://secure.gravatar.com/avatar/8a46aaa3e1f6249d3aac48b14f576580?s=96&d=mm&r=g"}}}}}]},"latest":{"edges":[{"node":{"title":"Startup Spotlight – Kola Market","excerpt":"<p>They help small and medium-sized businesses to drive sales all year round, increase their profits and grow sustainably.</p>\n","slug":"startup-spotlight-kola-market","date":"2024-05-08T08:05:38","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/274AC94E-2155-4C6E-9B08-EA8D4977C203.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Startups","slug":"startups","categoryId":5}}]},"tags":{"edges":[{"node":{"name":"Female-founder"}},{"node":{"name":"Founder"}},{"node":{"name":"Startup"}}]}}},{"node":{"title":"Meet Olajumoke Oduwole: Founder of KJK Africa ","excerpt":"<p>She has been trained in entrepreneurship and business management in nine top-notch accelerator programs and enterprise development centres in Africa and Europe.</p>\n","slug":"women-in-tech-olajumoke-oduwole","date":"2024-05-08T07:58:40","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/EDA185BF-30ED-418A-826C-07B542D1A034.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Founders","slug":"founders","categoryId":4}}]},"tags":{"edges":[{"node":{"name":"Female-founder"}},{"node":{"name":"Founder"}},{"node":{"name":"Startup"}}]}}},{"node":{"title":"Rose-Margaret Ekeng-Itua has become the first black woman to hold a PhD in Cybernetics","excerpt":"<p>An award-winning Nigerian Professor, Rose-Margaret Ekeng-Itua, has emerged as the first black woman in the world to earn a doctorate (PhD) in Cybernetics, which is the scientific study of control and communication in animals and machines, concerned with understanding complex systems like learning, cognition, adaptation, emergence, communication, and efficiency. Rose-Margaret is a pioneering educator, administrator, [&hellip;]</p>\n","slug":"rose-margaret-ekeng-itua-has-become-the-first-black-woman-to-hold-a-phd-in-cybernetics","date":"2024-05-07T18:05:21","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/IMG_1593.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"News","slug":"news","categoryId":8}}]},"tags":{"edges":[{"node":{"name":"Cybernetics"}},{"node":{"name":"News"}},{"node":{"name":"Tech"}}]}}},{"node":{"title":"Tech Sales vs Business Development","excerpt":"<p>Tech sales and Business development are important for generating revenue for companies in the tech industry. While both of them play the same role of contributing to the company’s growth, they do it in a different way and timeframe. Tech sales focus on closing deals with different customers, while business development creates new business opportunities [&hellip;]</p>\n","slug":"tech-sales-vs-business-development","date":"2024-05-07T14:56:20","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/joyful-successful-sales-agent-presenting-content-tablet-scaled.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Essays","slug":"essays","categoryId":1}}]},"tags":{"edges":[{"node":{"name":"Business Development"}},{"node":{"name":"Sales"}},{"node":{"name":"Tech"}}]}}},{"node":{"title":"The Stack Journal Launches Website for Women-Focused Tech News.","excerpt":"<p>According to Kiki Mordi, founder and CEO, The Stack Journal is forging partnerships with women in the tech industry.</p>\n","slug":"the-stack-journal-launches-website-for-women-focused-tech-news","date":"2024-05-02T09:56:59","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/96th-TSJ-7229.jpg"}},"author":{"node":{"name":"Kiki Mordi","firstName":"Kiki","lastName":"Mordi","avatar":{"url":"https://secure.gravatar.com/avatar/58f2fe88027e1ca7ef77f058feb3bde2?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"News","slug":"news","categoryId":8}}]},"tags":{"edges":[{"node":{"name":"Female-founder"}},{"node":{"name":"News"}},{"node":{"name":"Tech"}}]}}}]},"categories":{"edges":[{"node":{"name":"Awards","slug":"awards"}},{"node":{"name":"Dear Tech Sis","slug":"dear-tech-sis"}},{"node":{"name":"Essays","slug":"essays"}},{"node":{"name":"Events","slug":"events"}},{"node":{"name":"Founders","slug":"founders"}},{"node":{"name":"Industry Report","slug":"industry-report"}},{"node":{"name":"News","slug":"news"}},{"node":{"name":"Opportunities","slug":"opportunities"}},{"node":{"name":"Startups","slug":"startups"}},{"node":{"name":"uncategorized","slug":"uncategorized"}}]}},"__N_SSG":true}