{"pageProps":{"preview":false,"post":{"title":"The Impact Of The Twitter Ban On Cybersecurity And Organisation For Women","excerpt":"<p>Social media and Twitter in particular have been used to champion numerous causes and they have become the amplifier of the voice of the voiceless time and time again.</p>\n","slug":"the-impact-of-the-twitter-ban-on-cybersecurity-and-organisation-for-women","date":"2021-06-08T15:50:00","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/03/ul4auboxu1oxkdt9khtt.jpg"}},"author":{"node":{"name":"Atinuke","firstName":null,"lastName":"Atinuke","avatar":{"url":"https://secure.gravatar.com/avatar/2bd06a084e8eea9d9a5ba5be4402adc6?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Essays","slug":"essays","categoryId":1}}]},"tags":{"edges":[{"node":{"name":"Cybersecurity"}},{"node":{"name":"Tech"}},{"node":{"name":"Women"}}]},"content":"\n<p>Social media and Twitter in particular have been used to champion numerous causes and they have become the amplifier of the voice of the voiceless time and time again. The Nigerian government’s Twitter ban is not only in conflation with the right to freedom of expression and speech through any given medium; it is also a gag on the advocacy and activism that thrives on such platforms.&nbsp;</p>\n\n\n\n<p>Organisation for the revolutionary causes that have marked Nigeria’s recent history took place right before our eyes on Twitter. It has fast become the sole vessel for demanding accountability from our government and individuals.</p>\n\n\n\n<p>We spoke to Sophina Kio-Lawson, a security analyst and engineer. She is the co-founder for SheSecures, an initiative that promotes cyber literacy; inspires and empowers young African women in information and cybersecurity.&nbsp;</p>\n\n\n\n<p><strong>A: What do you think the impact of this ban will be on women’s rights; especially considering the political climate of the country and the characteristic trivialization of women’s issues?</strong></p>\n\n\n\n<p><strong>S:</strong>&nbsp;We have seen the force of Twitter and how impactful it can be when it comes to starting or driving revolutions, activism, or rallying for help and asking for support from other citizens. It is a global digital city running 24/7 and you’re bound to have someone come to your aid. We know it, the Nigerian government clearly knows this too and they can’t stand that.&nbsp; So, they do all they can to control and suppress that.</p>\n\n\n\n<p>What I see is a decline coming in the number of social causes that women have been able to lead on Twitter if this ban persists. For instance; mobilization for women and queer rights, reporting GBV issues, locating innocent people that have been kidnapped and various other forms of activism would stop being amplified at the level that we want it to be.  I fear that so many things might not be brought to light, and we know how the mainstream media underreports a lot of these issues that go on; So, if the government keeps stifling the rights of its citizens in this manner, people’s lives become endangered. It also takes away the freedom of expression and identity of women and those who have found their identities and families online. It’s sickening. </p>\n\n\n\n<p>We’ve already seen and heard of people trivializing the cases of missing women. “Oh they’re not missing, don’t reach out for help anymore, they are at their boyfriend’s place.” So, you’re literally taking the voices of thousands, if not millions of women away and dismissing any opportunity they may have to come forward with issues they are likely to experience.</p>\n\n\n\n<p>As much as there have been provisions in circumventing the ban and accessing Twitter by a few citizens, what about those who can’t get access to a VPN? We automatically assume everyone is savvy enough to use a VPN because they have a Twitter account. But that’s not the case.&nbsp;</p>\n\n\n\n<p>So, I do worry – for a situation like Ini whose friend could easily rally support from friends and strangers to ensure her friend gets Justice. What if Ini’s friend can’t find her way using a VPN. We know Facebook, WhatsApp and Instagram don’t provide a lifeline as much as Twitter does. This gets me worried.</p>\n\n\n\n<p>Lastly, it may instil more fear into women who depend on the platform for jobs and promoting their businesses. We know how hard the streets are when it comes to getting funding for small businesses and the very few who can get promotions can’t do that as much as they can because the number of people on the platform currently would have hit a major decline. In all, you’re bound to see more women without jobs if this persists.&nbsp;</p>\n\n\n\n<p><strong>A: How can women keep safe in these times?</strong></p>\n\n\n\n<p><strong>S:&nbsp;</strong>&nbsp;</p>\n\n\n\n<ol>\n<li>Online:</li>\n</ol>\n\n\n\n<p>I’d say just be extremely cautious and guided with how you’re trying to circumvent this ban. As much as there are good people on the web, there are also twice as many bad folks on it. So, be wary of certain recommendations from self-acclaimed helpers who’d want to provide you with various options to bypass the Twitter ban. If you’re an Apple user (iOS) make sure it’s directly from the App Store, the same thing goes to android users (google play store) and make sure you’ve gone through a couple of reviews to see what other users are saying.</p>\n\n\n\n<p>Check out SheSecures (@she_secures) which provides you with occasional digital security literacy gems and ways to stay safe online. We try to provide useful tips on the go as we see them and they are usually tools or solutions that have been recommended by several security researchers, professionals and people who are knowledgeable about security.</p>\n\n\n\n<ol start=\"2\">\n<li>Physically:</li>\n</ol>\n\n\n\n<p>We just have to keep doing the things we’ve always done. Make people aware of where you’re going. Tell your friends and family, have your live locations turned on if you’re going to meet someone new or a place you’ve never been before.</p>\n\n\n\n<p>-SERAP has set up free hotlines for anyone who gets harassed, arrested, or jailed as a result of the Twitter ban. Use those lines and have them at your fingertips.&nbsp;</p>\n\n\n\n<ol start=\"3\">\n<li>Mentally:</li>\n</ol>\n\n\n\n<p>Protect your mental space because Nigerian activism saps a whole lot of energy from you, and you may feel like you’re losing it but do what you can and ensure you’re giving yourself enough room and grace to be able to live and fight another day. Reach out to groups for help and support if you’re feeling drained. Follow accounts that are consciously helping you stay sane.&nbsp;</p>\n\n\n\n<p><strong>A: How do you think women can organise outside of Twitter using technology?</strong></p>\n\n\n\n<p><strong>S:&nbsp;</strong>Still focusing on using technology, there are other platforms that women can keep organizing and leading on movements.</p>\n\n\n\n<p>If we are talking about doing this securely; then we can ask folx to set up groups and keep on having conversations on apps like signal messenger, telegram, Bridgefy and Firechat. These are offline messaging apps that let you communicate with friends and family when you don’t have internet access just by switching on your internet. Although some are restricted to people within the same vicinity) or Lantern.</p>\n\n\n\n<p>If we are referring to public online spaces (that may not provide as much anonymity and high level of security); a lot of activism still goes on via Instagram (From the recent events of EndSARS and the live videos as well), so we know that’s been helpful on a global scale. We’ve got Facebook and WhatsApp for rebroadcasting messages quickly and getting the word out. We can keep on utilizing these platforms and keep spreading the word, getting people together and organizing for the causes that matter.</p>\n\n\n\n<p>For conference calls, we can rely on Zoom, Google Duo, Signal, recently included SignalBoost.info (which empowers people to quickly amplify their message to thousands of people and directly engage those who want to get involved, securely and privately), Clubhouse (albeit with its security concerns can provide a temporary space for not so private conversations to aid organizers)</p>\n\n\n\n<p>Asides from that, I’d say we shouldn’t exclude the need for more offline and on-ground grassroots movements and work with organizations that are already helping to amplify such support.</p>\n\n\n\n<p><strong>A: From a legal perspective, what next for Nigerian women and Nigerians as a collective?&nbsp;</strong></p>\n\n\n\n<p><strong>S:&nbsp;</strong>So, Nigerian women and Nigerians as a whole ought not to stop speaking about the situation on the ground. we can’t afford to be complacent, certainly not at this time. If we adapt just because we are Nigerians and we have survival genes, what happens when the fire gets bigger and there’s a total internet shutdown. What happens when they come for other platforms? What happens when they start shutting the bank accounts of anyone who uses Twitter? They’ve done it with crypto, they’ve done with EndSARS so what makes us think they wouldn’t do it again and at much crazier levels. We shouldn’t undermine the extent of the evil of this government.</p>\n\n\n\n<p>Let’s keep the conversation and awareness going, call out the human rights violations and hold these leaders accountable on a global stage. I’m not referring to just the President, but also the Governors, the representatives, council reps, anyone you can think of that doesn’t do their job. </p>\n\n\n\n<p>Know your rights and what the constitution says about freedom of expression. When these leaders try to bully you, harass you, etc. Call them out on their bullshit and let them know you know your rights.&nbsp;</p>\n\n\n\n<h3 class=\"wp-block-heading\">As individuals, we should also throw our weight and show solidarity to organisations taking on the government. They need us and can’t do it alone. If there’s a protest, pull up. If there’s a boycott, join in. If there’s a hashtag trending, help spread it further. But whatever you do, don’t stay silent. There’s more work to be done and we’ve got to do it together.</h3>\n"},"posts":{"edges":[{"node":{"title":"Tech Sales vs Business Development","excerpt":"<p>Tech sales and Business development are important for generating revenue for companies in the tech industry. While both of them play the same role of contributing to the company’s growth, they do it in a different way and timeframe. Tech sales focus on closing deals with different customers, while business development creates new business opportunities [&hellip;]</p>\n","slug":"tech-sales-vs-business-development","date":"2024-05-07T14:56:20","categories":{"edges":[{"node":{"name":"Essays","slug":"essays"}}]},"featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/joyful-successful-sales-agent-presenting-content-tablet-scaled.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}}}},{"node":{"title":"Everything you need to know about Product Management ","excerpt":"<p>Product Management is a key function in any business that wants to create and launch successful products.</p>\n","slug":"everything-you-need-to-know-about-product-management","date":"2024-04-16T20:02:39","categories":{"edges":[{"node":{"name":"Essays","slug":"essays"}}]},"featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/04/jason-goodman-Oalh2MojUuk-unsplash-scaled.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}}}},{"node":{"title":"Web Development 101: Front-End vs. Back-End Explained","excerpt":"<p>If front-end development is the application’s face, then the back-end is the brain.</p>\n","slug":"web-development-101-front-end-vs-back-end-explained-2","date":"2024-04-16T19:30:56","categories":{"edges":[{"node":{"name":"Essays","slug":"essays"}}]},"featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/04/fotis-fotopoulos-DuHKoV44prg-unsplash-scaled.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}}}},{"node":{"title":"Popular Myths about Women in Tech","excerpt":"<p>Statistics have shown us that the female gender is still under-represented, hence the reason why we must advocate for more women in the industry to create a balance. </p>\n","slug":"popular-myths-about-women-in-tech","date":"2024-04-02T09:10:10","categories":{"edges":[{"node":{"name":"Essays","slug":"essays"}}]},"featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/04/close-up-woman-being-surprised-scaled.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}}}}]},"latest":{"edges":[{"node":{"title":"Startup Spotlight – Kola Market","excerpt":"<p>They help small and medium-sized businesses to drive sales all year round, increase their profits and grow sustainably.</p>\n","slug":"startup-spotlight-kola-market","date":"2024-05-08T08:05:38","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/274AC94E-2155-4C6E-9B08-EA8D4977C203.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Startups","slug":"startups","categoryId":5}}]},"tags":{"edges":[{"node":{"name":"Female-founder"}},{"node":{"name":"Founder"}},{"node":{"name":"Startup"}}]}}},{"node":{"title":"Meet Olajumoke Oduwole: Founder of KJK Africa ","excerpt":"<p>She has been trained in entrepreneurship and business management in nine top-notch accelerator programs and enterprise development centres in Africa and Europe.</p>\n","slug":"women-in-tech-olajumoke-oduwole","date":"2024-05-08T07:58:40","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/EDA185BF-30ED-418A-826C-07B542D1A034.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Founders","slug":"founders","categoryId":4}}]},"tags":{"edges":[{"node":{"name":"Female-founder"}},{"node":{"name":"Founder"}},{"node":{"name":"Startup"}}]}}},{"node":{"title":"Rose-Margaret Ekeng-Itua has become the first black woman to hold a PhD in Cybernetics","excerpt":"<p>An award-winning Nigerian Professor, Rose-Margaret Ekeng-Itua, has emerged as the first black woman in the world to earn a doctorate (PhD) in Cybernetics, which is the scientific study of control and communication in animals and machines, concerned with understanding complex systems like learning, cognition, adaptation, emergence, communication, and efficiency. Rose-Margaret is a pioneering educator, administrator, [&hellip;]</p>\n","slug":"rose-margaret-ekeng-itua-has-become-the-first-black-woman-to-hold-a-phd-in-cybernetics","date":"2024-05-07T18:05:21","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/IMG_1593.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"News","slug":"news","categoryId":8}}]},"tags":{"edges":[{"node":{"name":"Cybernetics"}},{"node":{"name":"News"}},{"node":{"name":"Tech"}}]}}},{"node":{"title":"Tech Sales vs Business Development","excerpt":"<p>Tech sales and Business development are important for generating revenue for companies in the tech industry. While both of them play the same role of contributing to the company’s growth, they do it in a different way and timeframe. Tech sales focus on closing deals with different customers, while business development creates new business opportunities [&hellip;]</p>\n","slug":"tech-sales-vs-business-development","date":"2024-05-07T14:56:20","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/joyful-successful-sales-agent-presenting-content-tablet-scaled.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Essays","slug":"essays","categoryId":1}}]},"tags":{"edges":[{"node":{"name":"Business Development"}},{"node":{"name":"Sales"}},{"node":{"name":"Tech"}}]}}},{"node":{"title":"The Stack Journal Launches Website for Women-Focused Tech News.","excerpt":"<p>According to Kiki Mordi, founder and CEO, The Stack Journal is forging partnerships with women in the tech industry.</p>\n","slug":"the-stack-journal-launches-website-for-women-focused-tech-news","date":"2024-05-02T09:56:59","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/96th-TSJ-7229.jpg"}},"author":{"node":{"name":"Kiki Mordi","firstName":"Kiki","lastName":"Mordi","avatar":{"url":"https://secure.gravatar.com/avatar/58f2fe88027e1ca7ef77f058feb3bde2?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"News","slug":"news","categoryId":8}}]},"tags":{"edges":[{"node":{"name":"Female-founder"}},{"node":{"name":"News"}},{"node":{"name":"Tech"}}]}}}]},"categories":{"edges":[{"node":{"name":"Awards","slug":"awards"}},{"node":{"name":"Dear Tech Sis","slug":"dear-tech-sis"}},{"node":{"name":"Essays","slug":"essays"}},{"node":{"name":"Events","slug":"events"}},{"node":{"name":"Founders","slug":"founders"}},{"node":{"name":"Industry Report","slug":"industry-report"}},{"node":{"name":"News","slug":"news"}},{"node":{"name":"Opportunities","slug":"opportunities"}},{"node":{"name":"Startups","slug":"startups"}},{"node":{"name":"uncategorized","slug":"uncategorized"}}]}},"__N_SSG":true}