{"pageProps":{"preview":false,"post":{"title":"What Does it Mean to Be a Customer Support Manager? Insights from Chimuanya Dike","excerpt":"<p>Customer support plays an important role in the tech industry, especially in tech companies. It is responsible for helping customers with questions, concerns, and issues related to the company&#8217;s products or services. Customer support professionals speak with their customers via phone, email, chat support, etc. In our tech world today, customer support is often integrated [&hellip;]</p>\n","slug":"what-does-it-mean-to-be-a-customer-support-manager-insights-from-chimuanya-dike","date":"2024-05-02T09:54:28","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/CHIMUANYA_DIKE-scaled.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Dear Tech Sis","slug":"dear-tech-sis","categoryId":3}}]},"tags":{"edges":[{"node":{"name":"Customer support"}},{"node":{"name":"No-Code"}},{"node":{"name":"Tech"}}]},"content":"\n<p>Customer support plays an important role in the tech industry, especially in tech companies. It is responsible for helping customers with questions, concerns, and issues related to the company&#8217;s products or services. Customer support professionals speak with their customers via phone, email, chat support, etc. In our tech world today, customer support is often integrated with digital tools and software to help streamline the process and make it easier for the company and its customers.&nbsp;</p>\n\n\n\n<p>We spoke to<a href=\"https://www.linkedin.com/in/chimuanyaannedike?utm_source=share&amp;utm_campaign=share_via&amp;utm_content=profile&amp;utm_medium=ios_app\"> Chimuanya Dike</a>, a customer support manager with over six years of experience on what it is like to be in the no-code part of tech.</p>\n\n\n\n<p><strong>The Stack Journal: </strong>Good Afternoon; what is your name and role in the tech Industry?</p>\n\n\n\n<p><strong>Chimuanya:</strong> Hello, good afternoon; my name is Chimuanya Dike, and I am currently a customer support manager for Fronesyz Limited. I am in the no-code Industry.</p>\n\n\n\n<p><strong>The Stack Journal:</strong> Nice to meet you, Chimuanya! It seems like the concept of No-code in tech is not discussed as much in the tech industry. Why do you think that is?</p>\n\n\n\n<p><strong>Chimuanya: </strong>Yes, it is rarely discussed because some still believe that tech is for technical people. They think it is only for people who write software or deal with servers, databases, etc. They probably need to learn that there are other tech aspects, which is why we need people to push the no-code agenda. There are other tech roles that should be talked about; examples of these are customer service, customer support, social media manager and the like. The no-code roles that people get to focus on are probably Project/product manager, etc.&nbsp;</p>\n\n\n\n<p>That is why I like to tell people to focus on other things. Some other organisations are already pushing the no-code angle, but I would still like to create awareness with my own brand because I actually enjoy the role and work remotely, too.&nbsp;</p>\n\n\n\n<p><strong>The Stack Journal: </strong>This is really good. I like that we are talking about it now and that you are using your voice to create awareness. What inspired you to pursue a career in customer support?</p>\n\n\n\n<p><strong>Chimuanya:</strong> I have always liked engaging people and connecting with them. After studying microbiology in school and not getting an offer after volunteering at Pepsi, I decided to take advantage of my transferable skills that I could use in any field I found myself in, which is talking and engaging people. I realised customer support was a role I could fit easily in, making people and myself happy. So, immediately, I got an opportunity to intern at a software engineering company as a customer support personnel. I took it, and I loved it. While there, I managed their websites and attended to clients who came in to make enquiries, and from there, I moved to a bigger company. I am currently working at an app development company, and I am still enjoying it because it allows me to engage people and address their issues remotely.&nbsp;</p>\n\n\n\n<p><strong>The Stack Journal: </strong>What challenges have you faced in your career? Has working remotely affected your job in any way since you interact with customers a lot?</p>\n\n\n\n<p><strong>Chimuanya: </strong>Some challenges I faced when I first started was needing access to communities or people who were customer support experts. Maybe I didn&#8217;t do thorough research, but I couldn&#8217;t find anyone; I had to position myself well and do everything myself. This is why, after working for more than six years in customer support, I have taken it upon myself to share resources and mentor others who want to enter the field. I also recommend communities that people can join and courses they could take to make the transition more accessible for the younger generation. I have an <a href=\"https://selar.co/m/chimuanya-dike\">e-book</a> that I created and made very affordable for people who want to have a foundational knowledge of customer service or support.</p>\n\n\n\n<p>To answer your second question, working remotely has not affected me in any way; it has made me more productive. I started working fully remotely after COVID-19 about four years ago, and it has been great. I get to engage with customers from the comfort of my home without stress and with a fully rested mindset to respond to customers.&nbsp;</p>\n\n\n\n<p>Working remotely has actually helped me to manage my time well, and I also have access to my after-work life. You don&#8217;t necessarily have to see customers before you attend to them. You can respond to them via calls, chats, email, and social media, which has made our work very easy and responsive. Aside from this, we now have cloud service CRM tools, so you don&#8217;t have to be in a physical location to attend to customers.</p>\n\n\n\n<p><strong>The Stack Journal: </strong>Are there any women in the no-code field that inspire you?</p>\n\n\n\n<p><strong>Chimuanya: </strong>Yes, Oremeyi Adeola Akah, she is the Chief Customer Success Officer of Interswitch.</p>\n\n\n\n<p><strong>The Stack Journal: </strong>Thank you. To wrap this up, what advice do you have for women interested in pursuing a career in customer support?</p>\n\n\n\n<p><strong>Chimuanya: </strong>Okay, my advice for those women interested in transitioning to customer support is that they come with an open mind; they shouldn&#8217;t come with the mindset that this field is an easy route and access to go into tech and then change to other roles. They should love it and be ready to learn and upskill. You get a form of fulfilment not just in answering calls but also as a problem solver, so they should embrace it as a full-time career and carry their shoulders up as the Amazons that they are. Finally, they should always be ready to up-skill, learn, unlearn and relearn.&nbsp;</p>\n"},"posts":{"edges":[{"node":{"title":"Careers in Tech for Women to Pursue","excerpt":"<p> With access to free online courses, scholarships, and various learning resources, you can learn any tech skill of your choice. </p>\n","slug":"careers-in-tech-for-women-to-pursue","date":"2024-04-16T13:28:52","categories":{"edges":[{"node":{"name":"Dear Tech Sis","slug":"dear-tech-sis"}}]},"featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/04/magnet-me-JUpaXbh-Fgc-unsplash-scaled.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}}}},{"node":{"title":"5 Influential Women Making Waves in the Tech Industry","excerpt":"<p>Female talent from all across Africa, including Ghana, Kenya, Nigeria, and South Africa, are reshaping the technology narrative.</p>\n","slug":"5-influential-women-making-waves-in-the-tech-industry","date":"2024-04-02T12:00:00","categories":{"edges":[{"node":{"name":"Dear Tech Sis","slug":"dear-tech-sis"}}]},"featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/03/two-business-woman-cafe-scaled.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}}}},{"node":{"title":"Career Change; Transitioning From Law To Tech","excerpt":"<p>If you’re a woman in tech and would love to share a story, opinion piece, or anything at all with us, shoot us an email at thestackjournal@gmail.com! We’d love to hear from you. </p>\n","slug":"career-change-transitioning-from-law-to-tech","date":"2024-03-19T12:23:13","categories":{"edges":[{"node":{"name":"Dear Tech Sis","slug":"dear-tech-sis"}}]},"featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/03/pzenelq7yyrhhqsuwyjm.jpg"}},"author":{"node":{"name":"Oluwatobi Afolabi","firstName":"Oluwatobi","lastName":"Afolabi","avatar":{"url":"https://secure.gravatar.com/avatar/8a46aaa3e1f6249d3aac48b14f576580?s=96&d=mm&r=g"}}}}}]},"latest":{"edges":[{"node":{"title":"Startup Spotlight – Kola Market","excerpt":"<p>They help small and medium-sized businesses to drive sales all year round, increase their profits and grow sustainably.</p>\n","slug":"startup-spotlight-kola-market","date":"2024-05-08T08:05:38","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/274AC94E-2155-4C6E-9B08-EA8D4977C203.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Startups","slug":"startups","categoryId":5}}]},"tags":{"edges":[{"node":{"name":"Female-founder"}},{"node":{"name":"Founder"}},{"node":{"name":"Startup"}}]}}},{"node":{"title":"Meet Olajumoke Oduwole: Founder of KJK Africa ","excerpt":"<p>She has been trained in entrepreneurship and business management in nine top-notch accelerator programs and enterprise development centres in Africa and Europe.</p>\n","slug":"women-in-tech-olajumoke-oduwole","date":"2024-05-08T07:58:40","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/EDA185BF-30ED-418A-826C-07B542D1A034.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Founders","slug":"founders","categoryId":4}}]},"tags":{"edges":[{"node":{"name":"Female-founder"}},{"node":{"name":"Founder"}},{"node":{"name":"Startup"}}]}}},{"node":{"title":"Rose-Margaret Ekeng-Itua has become the first black woman to hold a PhD in Cybernetics","excerpt":"<p>An award-winning Nigerian Professor, Rose-Margaret Ekeng-Itua, has emerged as the first black woman in the world to earn a doctorate (PhD) in Cybernetics, which is the scientific study of control and communication in animals and machines, concerned with understanding complex systems like learning, cognition, adaptation, emergence, communication, and efficiency. Rose-Margaret is a pioneering educator, administrator, [&hellip;]</p>\n","slug":"rose-margaret-ekeng-itua-has-become-the-first-black-woman-to-hold-a-phd-in-cybernetics","date":"2024-05-07T18:05:21","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/IMG_1593.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"News","slug":"news","categoryId":8}}]},"tags":{"edges":[{"node":{"name":"Cybernetics"}},{"node":{"name":"News"}},{"node":{"name":"Tech"}}]}}},{"node":{"title":"Tech Sales vs Business Development","excerpt":"<p>Tech sales and Business development are important for generating revenue for companies in the tech industry. While both of them play the same role of contributing to the company’s growth, they do it in a different way and timeframe. Tech sales focus on closing deals with different customers, while business development creates new business opportunities [&hellip;]</p>\n","slug":"tech-sales-vs-business-development","date":"2024-05-07T14:56:20","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/joyful-successful-sales-agent-presenting-content-tablet-scaled.jpg"}},"author":{"node":{"name":"Miracle Okah","firstName":"Miracle","lastName":"Okah","avatar":{"url":"https://secure.gravatar.com/avatar/cebae8fde05b50de4eb6952005c1da27?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"Essays","slug":"essays","categoryId":1}}]},"tags":{"edges":[{"node":{"name":"Business Development"}},{"node":{"name":"Sales"}},{"node":{"name":"Tech"}}]}}},{"node":{"title":"The Stack Journal Launches Website for Women-Focused Tech News.","excerpt":"<p>According to Kiki Mordi, founder and CEO, The Stack Journal is forging partnerships with women in the tech industry.</p>\n","slug":"the-stack-journal-launches-website-for-women-focused-tech-news","date":"2024-05-02T09:56:59","featuredImage":{"node":{"sourceUrl":"https://wp.thestackjournal.com/wp-content/uploads/2024/05/96th-TSJ-7229.jpg"}},"author":{"node":{"name":"Kiki Mordi","firstName":"Kiki","lastName":"Mordi","avatar":{"url":"https://secure.gravatar.com/avatar/58f2fe88027e1ca7ef77f058feb3bde2?s=96&d=mm&r=g"}}},"categories":{"edges":[{"node":{"name":"News","slug":"news","categoryId":8}}]},"tags":{"edges":[{"node":{"name":"Female-founder"}},{"node":{"name":"News"}},{"node":{"name":"Tech"}}]}}}]},"categories":{"edges":[{"node":{"name":"Awards","slug":"awards"}},{"node":{"name":"Dear Tech Sis","slug":"dear-tech-sis"}},{"node":{"name":"Essays","slug":"essays"}},{"node":{"name":"Events","slug":"events"}},{"node":{"name":"Founders","slug":"founders"}},{"node":{"name":"Industry Report","slug":"industry-report"}},{"node":{"name":"News","slug":"news"}},{"node":{"name":"Opportunities","slug":"opportunities"}},{"node":{"name":"Startups","slug":"startups"}},{"node":{"name":"uncategorized","slug":"uncategorized"}}]}},"__N_SSG":true}